[
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "German-born British subject, Baron Julius de Reuter, of news agency fame, won the most breathtaking one of all. In 1872, for a paltry sum and a promise of future royalties, he acquired the exclusive right to run the country’s industries, irrigate its farmland, exploit its mineral resources, develop its railroad and streetcar lines, establish its national bank, and print its currency. Lord Curzon described this as “the most complete and extraordinary surrender of the entire industrial resources of a kingdom into foreign hands that has probably ever been dreamt of, much less accomplished, in history.” Many were angered",
    "page": 49,
    "location": {
      "start": 618,
      "end": 623
    },
    "dateAdded": 1706054081
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "They chose the British Legation, a sprawling compound with lands covering",
    "page": 53,
    "location": {
      "start": 684,
      "end": 685
    },
    "dateAdded": 1706486667
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "“One remarkable feature of this revolution here—for it is surely worthy to be called a revolution—is that the priesthood have found themselves",
    "page": 54,
    "location": {
      "start": 697,
      "end": 698
    },
    "dateAdded": 1706486720
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "“One remarkable feature of this revolution here—for it is surely worthy to be called a revolution—is that the priesthood have found themselves on the side of progress and freedom.",
    "page": 54,
    "location": {
      "start": 697,
      "end": 698
    },
    "dateAdded": 1706486726
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "It pitted, in the words of one historian, “the Persian trait of openness and assimilation against the Islamic trait of insularity and traditionalism.”",
    "page": 56,
    "location": {
      "start": 728,
      "end": 730
    },
    "dateAdded": 1706487142
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "hire an American banker, Morgan Shuster, as Iran’s treasurer-general.",
    "page": 57,
    "location": {
      "start": 737,
      "end": 737
    },
    "dateAdded": 1706487205
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "hire an American banker, Morgan Shuster, as Iran’s treasurer-general. Shuster arrived with a zealot’s energy and set out to dismantle the elaborate systems of tax exemptions and back-room deals through which British and Russian syndicates were looting Iran.",
    "page": 57,
    "location": {
      "start": 737,
      "end": 739
    },
    "dateAdded": 1706487210
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "“Reza Shah eliminated all the thieves and bandits in Iran,” one member of the British Parliament observed, “and made his countrymen realize that henceforth there would be only one thief in Iran.”",
    "page": 65,
    "location": {
      "start": 859,
      "end": 861
    },
    "dateAdded": 1706741521
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "If Iran had faced only domestic problems, Mossadegh might still be remembered only as a vigorous advocate of reform and modernization. The country’s main dilemma, however, centered around its relationship with outside powers, especially Britain and most especially the Anglo-Iranian Oil Company.",
    "page": 82,
    "location": {
      "start": 1098,
      "end": 1100
    },
    "dateAdded": 1706914802
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "Foreign Secretary Ernest Bevin was not exaggerating when he observed that without oil from Iran, there would be “no hope of our being able to achieve the standard of living at which we are aiming in Great Britain.”",
    "page": 94,
    "location": {
      "start": 1262,
      "end": 1264
    },
    "dateAdded": 1706915763
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "By choosing to travel to the United States, the Shah was recognizing the emergence of a new world power, one whose will would shape Iranian history more decisively than anyone could have then imagined.",
    "page": 97,
    "location": {
      "start": 1297,
      "end": 1298
    },
    "dateAdded": 1706915955
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "In response to this changing international climate, President Truman approved the creation of the Central Intelligence Agency in 1947.",
    "page": 114,
    "location": {
      "start": 1552,
      "end": 1553
    },
    "dateAdded": 1707092463
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "In January 1950 the National Security Council prepared a seminal document, known as NSC-68, that asserted the need for the United States to confront communist movements not only in regions of vital security interest but wherever they appeared.",
    "page": 114,
    "location": {
      "start": 1556,
      "end": 1558
    },
    "dateAdded": 1707092508
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "This debate sharpened over the next months. McGhee repeatedly warned directors of Anglo-Iranian that if they hoped to save Prime Minister Razmara and persuade the Majlis to approve their Supplemental Agreement, they must make concessions.",
    "page": 118,
    "location": {
      "start": 1604,
      "end": 1606
    },
    "dateAdded": 1707092824
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "The report concluded that Anglo-Iranian was an “exceptionally profitable” company, that it sold its oil for between ten and thirty times the cost of producing it, and that its arrogance had made it “genuinely hated in Iran.”",
    "page": 118,
    "location": {
      "start": 1607,
      "end": 1609
    },
    "dateAdded": 1707092843
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "He and others in the Truman administration never stopped urging their British counterparts to turn away from their policy of confrontation and to offer Mossadegh a legitimate compromise.",
    "page": 123,
    "location": {
      "start": 1689,
      "end": 1690
    },
    "dateAdded": 1707177462
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "declaring that Americans “fully recognize the sovereign rights of Iran and sympathize with Iran’s desire that increased benefits accrue to that country from the development of its petroleum.”",
    "page": 124,
    "location": {
      "start": 1702,
      "end": 1703
    },
    "dateAdded": 1707177574
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "he complained that the British held “a completely nineteenth-century colonial attitude toward Iran.” Instead of negotiating seriously, they issued only “rash statements” and “impulsive expressions of resentment” about what they considered the theft of their property in Iran.",
    "page": 145,
    "location": {
      "start": 1996,
      "end": 1998
    },
    "dateAdded": 1707349528
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "On October 19 the council voted “to postpone the discussion of the question to a certain day or indefinitely.” Britain and the United States abstained. It was a humiliating diplomatic defeat for the British.",
    "page": 167,
    "location": {
      "start": 2318,
      "end": 2320
    },
    "dateAdded": 1707694969
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "Mossadegh. They had concluded, in Acheson’s words, “that the British were so obstructive and determined on a rule-or-ruin policy in Iran that we must strike out on an independent policy or run the risk of having Iran disappear behind the Iron Curtain.”",
    "page": 188,
    "location": {
      "start": 2640,
      "end": 2642
    },
    "dateAdded": 1707786651
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "Roosevelt now had military units standing by to crush street disorders. His next task was to arrange the disorders.",
    "page": 220,
    "location": {
      "start": 3096,
      "end": 3097
    },
    "dateAdded": 1708134621
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "“My only crime,” Mossadegh told his judges, “is that I nationalized the Iranian oil industry and removed from this land the network of colonialism and the political and economic influence of the greatest empire on earth.”",
    "page": 247,
    "location": {
      "start": 3503,
      "end": 3505
    },
    "dateAdded": 1708304800
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "In the years after Mossadegh fell from power, Mohammad Reza Shah made him a nonperson about whom it was considered unseemly to speak. Little could be published about him, and nothing at all that was positive.",
    "page": 249,
    "location": {
      "start": 3528,
      "end": 3530
    },
    "dateAdded": 1708304938
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "Roosevelt concluded his White House briefing by warning that the CIA should not take his success in Iran to mean that it could now overthrow governments at will.",
    "page": 257,
    "location": {
      "start": 3654,
      "end": 3655
    },
    "dateAdded": 1708334413
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "With their devotion to radical Islam and their eagerness to embrace even the most horrific kinds of violence, Iran’s revolutionary leaders became heroes to fanatics in many countries. Among those who were inspired by their example were Afghans who founded the Taliban, led it to power in Kabul, and gave Osama bin-Laden the base from which he launched devastating terror attacks. It is not far-fetched to draw a line from Operation Ajax through the Shah’s repressive regime and the Islamic Revolution to the fireballs that engulfed the World Trade Center in New York.",
    "page": 260,
    "location": {
      "start": 3685,
      "end": 3689
    },
    "dateAdded": 1708334745
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "Operation Ajax taught tyrants and aspiring tyrants there that the world’s most powerful governments were willing to tolerate limitless oppression as long as oppressive regimes were friendly to the West and to Western oil companies.",
    "page": 260,
    "location": {
      "start": 3690,
      "end": 3691
    },
    "dateAdded": 1708334764
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "How did Iran reach the tragic crossroads of August 1953? The main responsibility lies with the obtuse neocolonialism that guided the Anglo-Iranian Oil Company and with the British government’s willingness to accept it.",
    "page": 263,
    "location": {
      "start": 3733,
      "end": 3734
    },
    "dateAdded": 1708335129
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "James A. Bill: American policy in Iran during the early 1950s succeeded in ensuring that there would be no Communist takeover in the country at the time, and that Iranian oil reserves would be available to the Western world at advantageous terms for two decades afterwards. It also deeply alienated Iranian patriots of all social classes and weakened the moderate, liberal nationalists represented by organizations like the National Front. This paved the way for the incubation of extremism, both of the left and of the right. This extremism became unalterably anti-American…. The fall of Mossadegh marked the end of a century of friendship between the two countries, and began a new era of U. S. intervention and growing hostility against the United States among the weakened forces of Iranian nationalism.",
    "page": 271,
    "location": {
      "start": 3848,
      "end": 3854
    },
    "dateAdded": 1708386696
  },
  {
    "book": "All the Shah's Men",
    "author": "Stephen Kinzer",
    "quote": "The coup bought the United States and the West a reliable Iran for twenty-five years.",
    "page": 275,
    "location": {
      "start": 3903,
      "end": 3904
    },
    "dateAdded": 1708387045
  }
]
