[{"book":"Consider Phlebas (Culture)","author":"Iain M. Banks","quote":"The Culture, there could be no doubt, relied profoundly on its machines for both its strategy and tactics in the war it was now engaged in. Indeed, a case could be made for holding that the Culture was its machines, that they represented it at a more fundamental level than did any single human or group of humans within the society.","page":90,"location":{"start":1493,"end":1495},"dateAdded":1711841047},{"book":"Consider Phlebas (Culture)","author":"Iain M. Banks","quote":"Fal ’Ngeestra was a Culture Referrer, one of those thirty, maybe forty, out of the eighteen trillion who could give you an intuitive idea of what was going to happen, or tell you why she thought that something which had already happened had happened the way it did, and almost certainly turn out right every time.","page":91,"location":{"start":1514,"end":1516},"dateAdded":1711841232},{"book":"Consider Phlebas (Culture)","author":"Iain M. Banks","quote":"There were in excess of eighteen trillion people in the Culture, just about every one of them well nourished, extensively educated and mentally alert, and only thirty or forty of them had this unusual ability to forecast and assess on a par with a well-informed Mind (of which there were already many hundreds of thousands). It was not impossible that this was pure luck; toss eighteen trillion coins in the air for a while and a few of them are going to keep landing the same side up for a long, long time.","page":91,"location":{"start":1511,"end":1514},"dateAdded":1711841243},{"book":"Consider Phlebas (Culture)","author":"Iain M. Banks","quote":"Fal thought it must be very strange to live on a planet and have to look over a curve; so that, for example, you would see the top of a seaship appear over the horizon before the rest of it.","page":92,"location":{"start":1536,"end":1537},"dateAdded":1711841430},{"book":"Consider Phlebas (Culture)","author":"Iain M. Banks","quote":"Still, the underlying point held; experience as well as common sense indicated that the most reliable method of avoiding self-extinction was not to equip oneself with the means to accomplish it in the first place.","page":96,"location":{"start":1604,"end":1606},"dateAdded":1711841873},{"book":"Consider Phlebas (Culture)","author":"Iain M. Banks","quote":"But the Idirans relied on themselves, not on their machines, and so they were still part of life. To him, that made all the difference","page":172,"location":{"start":2910,"end":2911},"dateAdded":1711976532},{"book":"Consider Phlebas (Culture)","author":"Iain M. Banks","quote":"They listened to common sense before their own emotions. The only thing they believed without proof was that there was a purpose to life, that there was something which was translated in most languages as “God,” and that that God wanted a better existence for His creations.","page":173,"location":{"start":2917,"end":2918},"dateAdded":1711977030}]