[{"book":"The Defining Decade","author":"Meg Jay","quote":"get married, pick a city, make money, buy a house, enjoy life, go to graduate school, start a business, get a promotion, save for college and retirement, and have two or three children in a much shorter period of time.","page":31,"location":{"start":337,"end":338},"dateAdded":1720398175},{"book":"The Defining Decade","author":"Meg Jay","quote":"We will hear why living together may not be the best way to test a relationship.","page":34,"location":{"start":376,"end":376},"dateAdded":1720398785},{"book":"The Defining Decade","author":"Meg Jay","quote":"As a twentysomething, it may feel like there are decades ahead to earn more and more but, on average, salaries peak—and plateau—in our forties.","page":45,"location":{"start":519,"end":521},"dateAdded":1720482051},{"book":"The Defining Decade","author":"Meg Jay","quote":"If we only wanted to be happy, it would be easy; but we want to be happier than other people, which is almost always difficult, since we think them happier than they are.","page":73,"location":{"start":873,"end":874},"dateAdded":1720571270},{"book":"The Defining Decade","author":"Meg Jay","quote":"Currently, the average age for first marriage is twenty-eight for women and thirty for men, such that only about 20 percent of twentysomethings have a spouse.","page":102,"location":{"start":1254,"end":1255},"dateAdded":1720883959},{"book":"The Defining Decade","author":"Meg Jay","quote":"Now I know that postponing marriage, in and of itself, does not make for a better union.","page":106,"location":{"start":1311,"end":1311},"dateAdded":1720884337},{"book":"The Defining Decade","author":"Meg Jay","quote":"am for twentysomethings knowing that, far from safeguarding them from divorce or unhappiness, moving in with someone can increase your chances of making a mistake","page":149,"location":{"start":1881,"end":1882},"dateAdded":1720996513},{"book":"The Defining Decade","author":"Meg Jay","quote":"am for twentysomethings knowing that, far from safeguarding them from divorce or unhappiness, moving in with someone can increase your chances of making a mistake—or of spending too much time on one.","page":149,"location":{"start":1881,"end":1882},"dateAdded":1720996518},{"book":"The Defining Decade","author":"Meg Jay","quote":"Traveling in another country is the closest thing there is to being married and raising kids.","page":151,"location":{"start":1908,"end":1908},"dateAdded":1720997237},{"book":"The Defining Decade","author":"Meg Jay","quote":"You have glorious hikes and perfect days on the beach. You go on adventures you would never try, or enjoy, alone. But you also can’t get away from each other. Everything is unfamiliar. Money is tight or you lose your passport. Someone gets sick or sunburned. You get bored. It is harder than you expected, but you are glad you didn’t just sit home. Provided Eli did not pop the question by some picturesque waterfall, this was exactly what he and his girlfriend needed. They needed to see how they traveled together.","page":152,"location":{"start":1908,"end":1912},"dateAdded":1720997244},{"book":"The Defining Decade","author":"Meg Jay","quote":"Life can only be understood backward, but it must be lived forward. —Søren Kierkegaard,","page":171,"location":{"start":2166,"end":2167},"dateAdded":1721088188},{"book":"The Defining Decade","author":"Meg Jay","quote":"Never again will we be so quick to learn new things. Never again will it be so easy to become the people we hope to be. So whatever it is we want to change about ourselves, our twenties are the easiest time to change it. The risk is that we may not act now.","page":179,"location":{"start":2277,"end":2279},"dateAdded":1721173868},{"book":"The Defining Decade","author":"Meg Jay","quote":"there has been a spirited debate among personality researchers about whether people change after age thirty. Numerous studies have shown that, relatively speaking, we don’t. After thirty, our thoughts and feelings and behaviors remain incredibly stable.","page":214,"location":{"start":2733,"end":2735},"dateAdded":1721231851},{"book":"The Defining Decade","author":"Meg Jay","quote":"Nancy Chodorow—a woman who is probably best known for writing a groundbreaking book about mothering. It is an over-simplification but, to be brief, the book makes a feminist argument for why many women want to be mothers and, even, get a lot of pleasure out of it.","page":225,"location":{"start":2870,"end":2872},"dateAdded":1721232462},{"book":"The Defining Decade","author":"Meg Jay","quote":"“They’re Waiting Longer, but U.S. Women Today More Likely to Have Children Than a Decade Ago.”","page":227,"location":{"start":2906,"end":2907},"dateAdded":1721260790},{"book":"The Defining Decade","author":"Meg Jay","quote":"This is because of two age-related changes that every woman can expect across her thirties and forties: Egg quality decreases, and the endocrine system, which regulates hormones and tells the body how to proceed with a pregnancy, becomes less effective.","page":232,"location":{"start":2970,"end":2971},"dateAdded":1721261098},{"book":"The Defining Decade","author":"Meg Jay","quote":"This is because of two age-related changes that every woman can expect across her thirties and forties: Egg quality decreases, and the endocrine system, which regulates hormones and tells the body how to proceed with a pregnancy, becomes less effective. With these changes, pregnancy becomes less likely, and miscarriage becomes more likely.","page":232,"location":{"start":2970,"end":2972},"dateAdded":1721261106},{"book":"The Defining Decade","author":"Meg Jay","quote":"one-quarter of pregnancies after thirty-five and half of pregnancies after forty miscarry","page":233,"location":{"start":2988,"end":2988},"dateAdded":1721261193},{"book":"The Defining Decade","author":"Meg Jay","quote":"“Many men and women feel hugely stretched and stressed trying to help out their not fully independent twentysomething children at the same time the health of their octogenarian parents is failing.”","page":235,"location":{"start":3025,"end":3027},"dateAdded":1721412276},{"book":"The Defining Decade","author":"Meg Jay","quote":"Men and women will soon face caring for two entirely dependent groups of loved ones at precisely the moment they are most needed back at work.","page":236,"location":{"start":3031,"end":3033},"dateAdded":1721412321},{"book":"The Defining Decade","author":"Meg Jay","quote":"not by twentysomethings and octogenarians but by toddlers and octogenarians. Men and women will soon face caring for two entirely dependent groups of loved ones at precisely the moment they are most needed back at work.","page":236,"location":{"start":3031,"end":3033},"dateAdded":1721412326},{"book":"The Defining Decade","author":"Meg Jay","quote":"Most twentysomethings can’t write the last sentence of their lives, but when pressed, they usually can identify things they want in their thirties or forties or sixties—or things they don’t want—and work backward from there. This is how you have your own multigenerational epic with a happy ending. This is how you live your life in real time.","page":250,"location":{"start":3206,"end":3209},"dateAdded":1721413279},{"book":"The Defining Decade","author":"Meg Jay","quote":"Be intentional. Get to work. Pick your family. Do the math. Make your own certainty. Don’t be defined by what you didn’t know or didn’t do.","page":253,"location":{"start":3240,"end":3242},"dateAdded":1721413392}]