[
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Listening To: Man-Made Rhythms Man: “Funky Drummer” by James Brown Drums played by Clyde Stubblefield Man Emulates Machine: “Billie Jean” by Michael Jackson Drums played by Ndugu Chancler, to a machine metronome Man Engages Machine: “Lady Cab Driver” by Prince Drums played by Prince and by the LM-1",
    "page": 118,
    "location": {
      "start": 1449,
      "end": 1456
    },
    "dateAdded": 1699916589000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Listening To: Machine Rhythms Machine: “Blue Monday” by New Order Drums on a rigid machine clock Machine Emulates Man: “Is It Live” by Run-DMC Drums using a “swing” function Machine Engages Man: “I Know You Got Soul” by Eric B. and Rakim Drums from a sample, looped every four bars The question became: What to do with all this power? Rick Rubin had already envisioned recorded hip-hop as collage art, and more specifically a collision of sonic elements, even before the advent of the sampler/sequencer. Marley Marl was arguably the first to employ the sampling drum machine in service to that end. From there onward, two different styles began to coalesce. Public Enemy and their production crew, the Bomb Squad, took a cue from Rick Rubin, the man who signed them to",
    "page": 123,
    "location": {
      "start": 1506,
      "end": 1518
    },
    "dateAdded": 1699916895000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Listening To: Machine Rhythms Machine: “Blue Monday” by New Order Drums on a rigid machine clock Machine Emulates Man: “Is It Live” by Run-DMC Drums using a “swing” function Machine Engages Man: “I Know You Got Soul” by Eric B. and Rakim Drums from a sample, looped every four bars",
    "page": 123,
    "location": {
      "start": 1506,
      "end": 1513
    },
    "dateAdded": 1699916901000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Slum Village released their first album. They called it Fan-Tas-Tic.",
    "page": 170,
    "location": {
      "start": 2212,
      "end": 2213
    },
    "dateAdded": 1700083574000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "In “I Don’t Know,” T3 came up",
    "page": 171,
    "location": {
      "start": 2222,
      "end": 2222
    },
    "dateAdded": 1700083631000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "The song that resulted, “Got ’Til It’s Gone,” built around a vocal sample of Joni Mitchell’s “Big Yellow Taxi,” was a conscious re-creation of Jay Dee’s groove, particularly the lagging bass line.",
    "page": 178,
    "location": {
      "start": 2330,
      "end": 2331
    },
    "dateAdded": 1700170930000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "But when it came time to spend money on his own drum machine, he bought an Akai MPC3000, the update to Roger Linn’s signature series.",
    "page": 185,
    "location": {
      "start": 2426,
      "end": 2427
    },
    "dateAdded": 1700171664000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "song called “Four”—penned and recorded by Prince under his jazz alias, Madhouse—",
    "page": 205,
    "location": {
      "start": 2686,
      "end": 2687
    },
    "dateAdded": 1700260507000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Listening To: Questlove’s Techniques “Mother’s Son” Technique The Model: “Mother’s Son” by Curtis Mayfield (start at 1:28) Questlove: “Greatdayndamornin’/Booty” by D’Angelo Rushed Snare Technique The Model: “Go Ladies” by Slum Village Questlove: “The Root” by D’Angelo",
    "page": 208,
    "location": {
      "start": 2732,
      "end": 2739
    },
    "dateAdded": 1700260750000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "And what that composition would become, once Common heard it and wrote his lyrics, was the song “Dooinit.”",
    "page": 215,
    "location": {
      "start": 2836,
      "end": 2837
    },
    "dateAdded": 1700294222000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "vibrating song after the incense smoke that drifted between them, “Nag Champa.”",
    "page": 219,
    "location": {
      "start": 2901,
      "end": 2902
    },
    "dateAdded": 1700294529000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "when James really wanted to do it, he’d bring you something like “Thelonius”: a perfect song,",
    "page": 221,
    "location": {
      "start": 2939,
      "end": 2939
    },
    "dateAdded": 1700294726000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Of all the tracks that came out of the sessions at Electric Lady, this was the only one that D’Angelo, Questlove, Poyser, and Jay Dee worked on together. Yet these four began to see themselves as a unit.",
    "page": 230,
    "location": {
      "start": 3083,
      "end": 3084
    },
    "dateAdded": 1700295392000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Q-Tip’s first solo album, Amplified, each of them credited to “Jay Dee & Q-Tip for the Ummah”—",
    "page": 233,
    "location": {
      "start": 3119,
      "end": 3120
    },
    "dateAdded": 1700295704000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Okayplayer became the central web portal for the Roots, Common, D’Angelo, Talib Kweli, and many other neo-soul and hip-hop artists.",
    "page": 237,
    "location": {
      "start": 3187,
      "end": 3187
    },
    "dateAdded": 1700296073000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "The groove, which James would then chop and arrange with a chorus sung by D’Angelo, became the Slum Village song “Tell Me.”",
    "page": 242,
    "location": {
      "start": 3260,
      "end": 3261
    },
    "dateAdded": 1700296409000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "The Vibe “Soulquarians” shoot was the first time that these ten people had all been in the same room at the same time.",
    "page": 256,
    "location": {
      "start": 3470,
      "end": 3471
    },
    "dateAdded": 1700307061000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Jay Dee, the producer, had been associated with politically conscious, high-minded, bohemian hip-hop. James, the person, was quite the other thing, aligned more with the material obsessions of mainstream, commercial rap—bling, cars, big booty women.",
    "page": 275,
    "location": {
      "start": 3756,
      "end": 3758
    },
    "dateAdded": 1700309310000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "He’d been listening to the progressive rock band Pink Floyd’s Dark Side of the Moon. He asked himself: What would my version of that album sound like?",
    "page": 278,
    "location": {
      "start": 3801,
      "end": 3802
    },
    "dateAdded": 1700309483000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "She and Derek Dudley paired Common with the Neptunes, who had now become the go-to hitmakers of hip-hop.",
    "page": 281,
    "location": {
      "start": 3838,
      "end": 3839
    },
    "dateAdded": 1700309628000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Phonte discovered—as did Jay Dee and the great musicians before him stretching all the way back to Louis Armstrong—that delay communicated “cool.” I’ll get there when I get there. I’ll see you when I see you. It’ll be worth the wait.",
    "page": 310,
    "location": {
      "start": 4252,
      "end": 4254
    },
    "dateAdded": 1700513213000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Wolf joined an exclusive club of two people, just he and Erykah Badu, who dared to demand more from James and got it.",
    "page": 328,
    "location": {
      "start": 4520,
      "end": 4521
    },
    "dateAdded": 1700514616000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "The “Oblighetto Remix” by J Dilla was vindication for Eli Wolf,",
    "page": 328,
    "location": {
      "start": 4523,
      "end": 4523
    },
    "dateAdded": 1700514625000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Dwele to contribute vocals; they named it “Dime Piece.” The other was a completely finished song, “Won’t Do,”",
    "page": 404,
    "location": {
      "start": 5701,
      "end": 5702
    },
    "dateAdded": 1701008298000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "The name was a double entendre, referring to the sweet feelings and protectiveness that Dilla’s friends had developed for Maureen, and to the collection of pieces made for her benefit: Suite for Ma Dukes.",
    "page": 419,
    "location": {
      "start": 5933,
      "end": 5934
    },
    "dateAdded": 1701009371000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "Fucking around is the whole point. Glasper imagined John Coltrane returning to the earthly plane decades after his death, walking into a jazz club to witness a bunch of musicians, all playing like John Coltrane, and saying: I did all my work and died for this?",
    "page": 454,
    "location": {
      "start": 6446,
      "end": 6448
    },
    "dateAdded": 1702429729000
  },
  {
    "book": "Dilla Time",
    "author": "Dan Charnas",
    "quote": "The result was an album, released in 2012, Black Radio,",
    "page": 457,
    "location": {
      "start": 6484,
      "end": 6484
    },
    "dateAdded": 1702429902000
  }
]
