[
  {
    "book": "Giovanni's Room",
    "author": "James Baldwin",
    "quote": "For I am—or I was—one of those people who pride themselves on their willpower, on their ability to make a decision and carry it through. This virtue, like most virtues, is ambiguity itself. People who believe that they are strong-willed and the masters of their destiny can only continue to believe this by becoming specialists in self-deception. Their decisions are not really decisions at all—a real decision makes one humble, one knows that it is at the mercy of more things than can be named—but elaborate systems of evasion, of illusion, designed to make themselves and the world appear to be what they and the world are not.",
    "page": 26,
    "location": {
      "start": 274,
      "end": 278
    },
    "dateAdded": 1751384424
  },
  {
    "book": "Giovanni's Room",
    "author": "James Baldwin",
    "quote": "he wanted me to come home— to come home, as he said, and settle down, and whenever he said that I thought of the sediment at the bottom of a stagnant pond.",
    "page": 28,
    "location": {
      "start": 294,
      "end": 295
    },
    "dateAdded": 1751384496
  },
  {
    "book": "Giovanni's Room",
    "author": "James Baldwin",
    "quote": "'I don't see why the world is so new for Americans,' said Giovanni. 'After all, you are all merely emigrants. And you did not leave Europe so very long ago.' 'The ocean is very wide,' I said. 'We have led different lives than you; things have happened to us there which have never happened here. Surely you can understand that this would make us a different people?'",
    "page": 39,
    "location": {
      "start": 442,
      "end": 444
    },
    "dateAdded": 1751385148
  },
  {
    "book": "Giovanni's Room",
    "author": "James Baldwin",
    "quote": "But I am not a housewife—men never can be housewives.",
    "page": 92,
    "location": {
      "start": 1103,
      "end": 1104
    },
    "dateAdded": 1751825692
  },
  {
    "book": "Giovanni's Room",
    "author": "James Baldwin",
    "quote": "Yet I also suspected that what I was seeing was but a part of the truth and perhaps not even the most important part; beneath these faces, these clothes, accents, rudenesses, was power and sorrow, both unadmitted, unrealized, the power of inventors, the sorrow of the disconnected.",
    "page": 93,
    "location": {
      "start": 1127,
      "end": 1129
    },
    "dateAdded": 1751826349
  },
  {
    "book": "Giovanni's Room",
    "author": "James Baldwin",
    "quote": "What kind of life can two men have together, anyway?",
    "page": 146,
    "location": {
      "start": 1841,
      "end": 1842
    },
    "dateAdded": 1752395308
  },
  {
    "book": "Giovanni's Room",
    "author": "James Baldwin",
    "quote": "It was certainly not more than a week after this that Guillaume was found dead in the private quarters above his bar, strangled with the sash of his dressing gown.",
    "page": 152,
    "location": {
      "start": 1925,
      "end": 1926
    },
    "dateAdded": 1752395746
  },
  {
    "book": "Giovanni's Room",
    "author": "James Baldwin",
    "quote": "I trace it to something as fleeting as the tip of her breast lightly touching my forearm as she leaned over me to serve my supper. I felt my flesh recoil. Her underclothes, drying in the bathroom, which I had often thought of as smelling even rather improbably sweet and as being washed much too often, now began to seem unaesthetic and unclean. A body which had to be covered with such crazy, catty-cornered bits of stuff began to seem grotesque. I sometimes watched her naked body move and wished that it were harder and firmer, I was fantastically mtimi-dated by her breasts, and when I entered her I began to feel that I would never get out alive. All that had once delighted me seemed to have turned sour on my stomach.",
    "page": 162,
    "location": {
      "start": 2048,
      "end": 2053
    },
    "dateAdded": 1752398396
  }
]
