[{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"He seldom got downright drunk, but he did enjoy feeling misty along about sundown, keeping his mood good with tasteful swigs as the sky to the west began to color up.","page":null,"location":{"start":17341,"end":17343},"dateAdded":1728605066},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"a man looked straight up at the stars he was apt to get dizzy, the night was so clear.","page":null,"location":{"start":17529,"end":17530},"dateAdded":1738794421},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"though his day-to-day responsibilities had constantly shrunk over the last ten years, life did not seem easier. It just seemed smaller and a good deal more dull.","page":null,"location":{"start":17560,"end":17561},"dateAdded":1738794761},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"If Mr. Gus shot him it would mean Newt had one less friend. Since he had no family, this was not a thought to be taken lightly.","page":null,"location":{"start":17632,"end":17633},"dateAdded":1738795474},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"Augustus’s experience had taught him that hollow-cheeked beauty was a dangerous kind.","page":null,"location":{"start":17877,"end":17878},"dateAdded":1738796985},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"Lippy was so named because his lower lip was about the size of the flap on a saddlebag. He could tuck enough snuff under it to last a normal person at least a month; in general the lip lived a life of its own, there toward the bottom of his face. Even when he was just sitting quietly, studying his cards, the lip waved and wiggled as if it had a breeze blowing across it, which in fact it did. Lippy had something wrong with his nose and breathed with his mouth wide open.","page":null,"location":{"start":17895,"end":17899},"dateAdded":1738797122},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"“That hat looks about like a buffalo cud,” Augustus said.","page":null,"location":{"start":17894,"end":17895},"dateAdded":1738797128},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"bourn,” Augustus said, deliberately adopting the elegiac","page":null,"location":{"start":17975,"end":17976},"dateAdded":1738797627},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"Augustus sighed again and stood up. It looked like the easy life was over for a while. Call had idled too long, and now he was ready to make up for it by working six times as hard as a human should work.","page":null,"location":{"start":18929,"end":18931},"dateAdded":1739633784},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"He had known several men who blew their heads off, and he had pondered it much. It seemed to him it was probably because they could not take enough happiness just from the sky and the moon to carry them over the low feelings that came to all men.","page":null,"location":{"start":20452,"end":20453},"dateAdded":1739834393},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"She scolded July as freely as she scolded him, which didn’t seem right to Joe. But then July accepted it and never scolded back, so perhaps that was the way of the world: women scolded, and men kept quiet and stayed out of the way as much as possible.","page":null,"location":{"start":21184,"end":21186},"dateAdded":1739959681},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"Call had taken the precaution of buying a lead steer from the Pumphreys—a big, docile longhorn they called Old Dog.","page":null,"location":{"start":21868,"end":21869},"dateAdded":1740008031},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"“Sit with her—just sit with her,” Gus said. “She likes your company. I don’t know why.” Instead, Call sat by the river, night after night. There was a period when he wanted to go back, when it would have been nice to sit with Maggie a few minutes and watch her fiddle with her hair. But he chose the river, and his solitude, thinking that in time the feeling would pass, and best so: he would stop thinking about Maggie, she would stop thinking about him. After all, there were more talkative men than him—Gus and Jake, for two.","page":null,"location":{"start":23345,"end":23349},"dateAdded":1740207205},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"What he wanted most was what he could never have: for it not to have happened—any of it. Better by far never to have known the pleasure than to have the pain that followed.","page":null,"location":{"start":23384,"end":23385},"dateAdded":1740207508},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"“Son, this is a sad thing,” Augustus said. “Loss of life always is. But the life is lost for good. Don’t you go attempting vengeance. You’ve got more urgent business. If I ever run into Blue Duck I’ll kill him. But if I don’t, somebody else will. He’s big and mean, but sooner or later he’ll meet somebody bigger and meaner. Or a snake will bite him or a horse will fall on him, or he’ll get hung, or one of his renegades will shoot him in the back. Or he’ll just get old and die.” He went over and tightened the girth on his saddle. “Don’t be trying to give back pain for pain,” he said. “You can’t get even measures in business like this. You best go find your wife.”","page":null,"location":{"start":25121,"end":25126},"dateAdded":1740216213},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"The Rio Grande was shallow and warm, and no trouble to cross, whereas the farther north they went, the colder and swifter the rivers became.","page":null,"location":{"start":26566,"end":26567},"dateAdded":1740323110},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"Don’t you still want to marry her, Gus?” “No,” Augustus lied.","page":null,"location":{"start":29320,"end":29321},"dateAdded":1740872425},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"Deets felt a longing to be back, to sit in the corrals at night and wonder about the moon.","page":null,"location":{"start":29656,"end":29657},"dateAdded":1740873795},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"bear rose on his hind legs again, still snarling—one side was soaked with blood. To the men, the bear seemed to tower over them, although fifty yards away.","page":null,"location":{"start":29886,"end":29887},"dateAdded":1740874993},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"The cowboys had lived for months under the great bowl of the sky, and yet the Montana skies seemed deeper than the skies of Texas or Nebraska. Their depth and blueness robbed even the sun of its harsh force—it seemed smaller, in the vastness, and the whole sky no longer turned white at noon as it had in the lower plains. Always, somewhere to the north, there was a swath of blueness, with white clouds floating in it like petals in a pond.","page":null,"location":{"start":30100,"end":30103},"dateAdded":1741132445},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"The coolness of the air seemed to improve the men’s eyesight—they fell to speculating about how many miles they could see.","page":null,"location":{"start":30098,"end":30098},"dateAdded":1741132454},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"“Why, they’re the first pigs to walk all the way from Texas to Montana,” Augustus said. “That’s quite a feat for a pig.”","page":null,"location":{"start":30135,"end":30136},"dateAdded":1741132612},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"He and Augustus had discussed the question of leadership many times. “It ain’t complicated,” Augustus maintained. “Most men doubt their own abilities. You don’t. It’s no wonder they want to keep you around. It keeps them from having to worry about failure all the time.”","page":null,"location":{"start":30636,"end":30638},"dateAdded":1741457427},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"All he had to think about were mistakes, it seemed—mistakes and death. His old rangering gang was gone, only Pea Eye left, of all of them. Jake was dead in Kansas, Deets in Wyoming, and now Gus in Montana.","page":null,"location":{"start":30925,"end":30927},"dateAdded":1741482975},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"“Hell, I can barely sort out two memories myself,” Goodnight said. “It’s what I get for living too long. My head fills up and sloshes over, like a damn bucket. Whatever sloshes out is lost. I doubt I still know half of what I knew when I was fifty years old.”","page":null,"location":{"start":32028,"end":32030},"dateAdded":1741737914},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"“What’s train travel got to do with it?” “All this traveling by train weakens the memory—it’s bound to,” Call said. “A man that travels horseback needs to remember where the water holes are, but a man that rides in a train can forget about water holes, because trains don’t drink.”","page":null,"location":{"start":32031,"end":32034},"dateAdded":1741737952},{"book":"The Lonesome Dove Chronicles","author":"Larry McMurtry","quote":"Newt—the Captain’s son, most people thought, although the Captain himself had never owned to it—had been killed late in the summer when the Hell Bitch, the mare the Captain gave him, reared and fell back on him.","page":null,"location":{"start":32202,"end":32204},"dateAdded":1741738830}]