[{"book":"Rage","author":"Bob Woodward","quote":"“You can deal with Putin. Obama was never able to. There is just a fundamental dislike of one another. Putin is a terrible racist, as we all know. All Russians are, generally. And Obama had a terrible disdain for Putin.”","page":null,"location":{"start":323,"end":325},"dateAdded":1735521595},{"book":"Rage","author":"Bob Woodward","quote":"Third, Tillerson said, “I want you to promise me that we are never going to have a public dispute, because that doesn’t serve anyone.” In the New York real estate world, Trump had built a decades-long reputation for disparaging former business and romantic partners in the tabloid press after relationships turned sour. “If you’re unhappy with me, call me and ream my ass out,” Tillerson said. “It’s all behind closed doors. Because when I walk out that door, I serve you and the American people. I will not disparage anybody. It’s just not in my nature.” “Don’t worry,” Trump said, “we’re going to get along splendidly.”","page":null,"location":{"start":393,"end":398},"dateAdded":1735521917},{"book":"Rage","author":"Bob Woodward","quote":"Trump eventually ordered the closure of the Palestinian Liberation Organization office in Washington, D.C. in September 2018 and canceled nearly all U.S. aid to the West Bank and Gaza, as well as $360 million in annual aid previously given to the U.N. agency for Palestinian refugees.","page":null,"location":{"start":1099,"end":1101},"dateAdded":1735779865},{"book":"Rage","author":"Bob Woodward","quote":"Tillerson was never told why he was fired. The president did not give him a reason. It had earlier leaked out that Tillerson had called Trump a “fucking moron” at a July 20, 2017, Tank meeting. Probably nothing could have triggered Trump’s insecurities more.","page":null,"location":{"start":1512,"end":1513},"dateAdded":1735935676},{"book":"Rage","author":"Bob Woodward","quote":"“Dear Excellency,” Kim began. Trump later told me with pride that Kim addressed him as “Excellency.”","page":null,"location":{"start":1571,"end":1572},"dateAdded":1735956144},{"book":"Rage","author":"Bob Woodward","quote":"The diplomatic courtship between Trump and Kim in 2018 and 2019 is captured in 27 letters that I obtained and 25 are reported here for the first time. Florid and grandiloquent, they trace how the two forged a personal and emotional bond. Trump has personally said they are “love letters.” They are more than that—they reveal a decision by both to become friends. Whether genuine or not, probably only history will tell. The language is not out of the traditional diplomatic playbook. They resemble declarations of personal fealty that might be uttered by the Knights of the Round Table, or perhaps suitors.","page":null,"location":{"start":1637,"end":1642},"dateAdded":1735956463},{"book":"Rage","author":"Bob Woodward","quote":"The agreement was less specific regarding denuclearization than prior agreements Kim’s predecessors had signed in 1992 and 2005 during the Clinton and Bush administrations.","page":null,"location":{"start":1676,"end":1677},"dateAdded":1735956633},{"book":"Rage","author":"Bob Woodward","quote":"Whenever he would question something about Russia or Putin, the president would say, but they have nukes. They’ve got nukes. Coats must have heard it dozens of times. Once the president put it this way: “Russia has 1,243 fucking nuclear weapons.”","page":null,"location":{"start":1730,"end":1732},"dateAdded":1735956921},{"book":"Rage","author":"Bob Woodward","quote":"Other than the highly classified information about the malware, Trump said he wanted the intelligence leaders to tell the public. “You should do this,” Trump said pointing to Coats. “Go public. Dan, take that to the press corps here in the White House.” He wanted it done right away. “That’s great.”","page":null,"location":{"start":1777,"end":1779},"dateAdded":1735957134},{"book":"Rage","author":"Bob Woodward","quote":"Coats found that Trump was becoming more and more paranoid and lonely.","page":null,"location":{"start":1820,"end":1821},"dateAdded":1735957311},{"book":"Rage","author":"Bob Woodward","quote":"Trump wanted Coats to say there was no evidence of coordination or conspiracy with Russia in the 2016 presidential campaign. Coats repeatedly tried to point out that the FBI had a criminal side and an intelligence side. He had oversight and a role in the intelligence side. But he had no role, zero, in the criminal investigations—including the Mueller probe of Russian interference. Trump disagreed, or did not understand, and acted as if Coats was insubordinate.","page":null,"location":{"start":1840,"end":1844},"dateAdded":1735957430},{"book":"Rage","author":"Bob Woodward","quote":"In September 2015, Xi had said “China does not intend to pursue militarization” of the Spratlys. China’s continued militarization of the islands was considered a violation of the Law of the Sea treaty, which China had signed, and a U.N. tribunal in 2016 ruled China had no evidence for its claim to “historic rights” over large areas of the South China Sea.","page":null,"location":{"start":1886,"end":1888},"dateAdded":1735957831},{"book":"Rage","author":"Bob Woodward","quote":"“They run three miles in 18 minutes. And they’re all at over 21 pull-ups.”","page":null,"location":{"start":1905,"end":1905},"dateAdded":1735958033},{"book":"Rage","author":"Bob Woodward","quote":"The chairman could be a potent force in a time of war, as General Colin Powell had demonstrated when he served as chairman during the First Gulf War in 1991—one of the most sensible, short","page":null,"location":{"start":1929,"end":1930},"dateAdded":1735958173},{"book":"Rage","author":"Bob Woodward","quote":"The chairman could be a potent force in a time of war, as General Colin Powell had demonstrated when he served as chairman during the First Gulf War in 1991—one of the most sensible, short and relatively low-casualty wars of all time.","page":null,"location":{"start":1929,"end":1930},"dateAdded":1735958180},{"book":"Rage","author":"Bob Woodward","quote":"The result was a compromise that is one of the most confusing lines in the history of high-profile investigations: “While this report does not conclude that the president committed a crime, it also does not exonerate him.”","page":null,"location":{"start":2264,"end":2266},"dateAdded":1736035390},{"book":"Rage","author":"Bob Woodward","quote":"The CIA never figured out conclusively who wrote and crafted Kim’s letters to Trump. They were masterpieces. The analysts marveled at the skill someone brought to finding the exact mixture of flattery while appealing to Trump’s sense of grandiosity and being center stage in history.","page":null,"location":{"start":2633,"end":2635},"dateAdded":1736036841},{"book":"Rage","author":"Bob Woodward","quote":"You’ve got to find a way to stop this talk of hitting Soleimani, Mulvaney almost begged. Perhaps he’ll listen to you. Four days later, Trump ordered the drone strike which killed Soleimani.","page":null,"location":{"start":2862,"end":2864},"dateAdded":1736121131},{"book":"Rage","author":"Bob Woodward","quote":"“When’s the last time you apologized?” “Oh, I don’t know, but I think over a period—I would apologize. Here’s the thing: I’m never wrong. Okay. No, if I’m wrong—if I’m wrong—I believe in apologizing. This was a totally appropriate conversation. It was perfect. And again, if I did something wrong, I would apologize. Okay?”","page":null,"location":{"start":3001,"end":3004},"dateAdded":1736122174},{"book":"Rage","author":"Bob Woodward","quote":"It was first dubbed “2020 China Pneumonia Response,” then almost immediately renamed “2020 Pneumonia of Unknown Etiology Response.”","page":null,"location":{"start":3158,"end":3159},"dateAdded":1736556115},{"book":"Rage","author":"Bob Woodward","quote":"A Very Stable Genius, a book by my two Washington Post colleagues Philip Rucker and Carol Leonnig, was being released. The book was highly critical of him. “It won’t do well,” Trump told me. The book went on to became a number-one national and New York Times bestseller.","page":null,"location":{"start":3196,"end":3198},"dateAdded":1736556328},{"book":"Rage","author":"Bob Woodward","quote":"Despite the conclusive evidence that at least five people wanted the restrictions—Fauci, Azar, Redfield, O’Brien and Pottinger—in an interview March 19, President Trump told me he deserved exclusive credit for the travel restrictions from China. “I had 21 people in my office, in the Oval Office, and of the 21 there was one person that said we have to close it down. That was me. Nobody wanted to because it was too early.” On May 6, he told me, “And let me tell you, I had a room of 20 to 21 people and everyone in that room except me did not want to have that ban.” At least seven times, including a press briefing, a televised town hall, interviews on Fox News and ABC and in meetings with industry executives and Republican lawmakers, he has repeated versions of this story. Even when he made what appears to have been a tough and sound decision on the advice of his top national security and medical experts, he wanted—and took—all the credit for himself.","page":null,"location":{"start":3449,"end":3457},"dateAdded":1736557415},{"book":"Rage","author":"Bob Woodward","quote":"First, Kushner advised, go back and read a 2018 opinion column by The Wall Street Journal’s Pulitzer Prize–winning columnist Peggy Noonan. Her column on Trump said: “He’s crazy… and it’s kind of working.” Kushner made it clear that his endorsement of the column was not an aside or stray comment, but was central to understanding Trump.","page":null,"location":{"start":3708,"end":3711},"dateAdded":1736558480},{"book":"Rage","author":"Bob Woodward","quote":"That day, March 11, marked the beginning of a new consciousness in the country. There were over 1,000 cases and 37 deaths in the country. Colleges across the U.S. announced they were suspending classes. The actor Tom Hanks said that he and his wife, Rita Wilson, had tested positive for Covid-19 and would quarantine. More","page":null,"location":{"start":3994,"end":3996},"dateAdded":1736617170},{"book":"Rage","author":"Bob Woodward","quote":"Kushner gathered White House economists and data modelers he knew from the private sector in the Roosevelt Room. They pulled Medicare and Medicaid data and went hospital by hospital, getting the highest number of ventilators the hospital had ever billed for at one time, then aggregated the numbers on a state-by-state basis. Before FEMA sent out more ventilators, Kushner said, it would need to ask how many ventilators were in the state, how many anesthesia machines had the state converted to ventilators, and what was the state’s daily utilization rate?","page":null,"location":{"start":4158,"end":4161},"dateAdded":1736726933},{"book":"Rage","author":"Bob Woodward","quote":"I understood that Trump’s decision to publicly call coronavirus the “Chinese virus” had led some White House staffers to feel emboldened to criticize China even harder. Trump was worried because he knew words could cause wars. He had told them, “You can’t do that shit,” and stopped them fast. The scale of the problem had clearly sunk in. Trump almost sounded like a different person.","page":null,"location":{"start":4239,"end":4242},"dateAdded":1736727349},{"book":"Rage","author":"Bob Woodward","quote":"The president had given up on his plan to open the country by Easter. He sounded resigned, almost chastened, with a solemn tone unlike any I had heard in our previous nine interviews.","page":null,"location":{"start":4273,"end":4274},"dateAdded":1736727490},{"book":"Rage","author":"Bob Woodward","quote":"I told him people I talked to were saying the presidential race between him and Biden was now a coin toss. “You know, maybe,” he said. “And maybe not.” That sounded like a good description of a coin toss.","page":null,"location":{"start":4658,"end":4660},"dateAdded":1736901147},{"book":"Rage","author":"Bob Woodward","quote":"“It was difficult to understand how China had aggressive travel restrictions within China, and yet did not move to any travel restrictions” for people who wanted to leave China and go abroad, Redfield said.","page":null,"location":{"start":4813,"end":4814},"dateAdded":1737328538},{"book":"Rage","author":"Bob Woodward","quote":"“It was difficult to understand how China had aggressive travel restrictions within China, and yet did not move to any travel restrictions” for people who wanted to leave China and go abroad, Redfield said. “If there could have been one major, global action that could’ve really saved hundreds of thousands of lives, it’s if they had just shut down their out-of-China travel at the same time they shut down their intra-China travel.","page":null,"location":{"start":4813,"end":4816},"dateAdded":1737328554},{"book":"Rage","author":"Bob Woodward","quote":"They really locked down all of Wuhan at one point. I think they quarantined over 11 million people. You couldn’t go from Wuhan to Beijing, but you could go Wuhan to London.”","page":null,"location":{"start":4818,"end":4819},"dateAdded":1737328569},{"book":"Rage","author":"Bob Woodward","quote":"“Donald Trump is the first president in my lifetime who does not try to unite the American people—does not even pretend to try,” he continued. “Instead, he tries to divide us. We are witnessing the consequences of three years of this deliberate effort. We are witnessing the consequences of three years without mature leadership.”","page":null,"location":{"start":4873,"end":4876},"dateAdded":1737328791},{"book":"Rage","author":"Bob Woodward","quote":"and that, in fact, the virus was much worse. The day was a microcosm of Trump’s presidency, veering from “We have it under control” to “worse before it gets better,” all in the span of a few hours. It was just the most recent example—and the last before this book went to press—that Trump’s presidency was riddled with ambivalence, set on an uncertain course, swinging from combativeness to conciliation, and whipsawing from one statement or action","page":null,"location":{"start":5533,"end":5536},"dateAdded":1737766975},{"book":"Rage","author":"Bob Woodward","quote":"But now, I’ve come to the conclusion that the “dynamite behind the door” was in plain sight. It was Trump himself. The oversized personality. The failure to organize. The lack of discipline. The lack of trust in others he had picked, in experts. The undermining or the attempted undermining of so many American institutions. The failure to be a calming, healing voice. The unwillingness to acknowledge error. The failure to do his homework. To extend the olive branch. To listen carefully to others. To craft a plan. Mattis, Tillerson","page":null,"location":{"start":5543,"end":5547},"dateAdded":1737767040},{"book":"Rage","author":"Bob Woodward","quote":"And here was the problem: By undermining so many others not only had he shaken confidence in them but he had shaken confidence in himself.","page":null,"location":{"start":5552,"end":5553},"dateAdded":1737767078},{"book":"Rage","author":"Bob Woodward","quote":"Senator Lindsey Graham, Trump’s First Friend in the Senate, has often been portrayed as embarrassingly and shamelessly subservient to the president, but actually at times provided wise counsel, urging Trump to take a strategic view.","page":null,"location":{"start":5578,"end":5579},"dateAdded":1737767242},{"book":"Rage","author":"Bob Woodward","quote":"The deep-seated hatreds of American politics flourished in the Trump years. He stoked them, and did not make concerted efforts to bring the country together. Nor did the Democrats. Trump felt deeply wronged by the Democrats who felt deeply wronged by Trump. The walls between them only grew higher and thicker.","page":null,"location":{"start":5589,"end":5591},"dateAdded":1737767296},{"book":"Rage","author":"Bob Woodward","quote":"When his performance as president is taken in its entirety, I can only reach one conclusion: Trump is the wrong man for the job.","page":null,"location":{"start":5624,"end":5625},"dateAdded":1737767413}]