[{"book":"The Right Stuff","author":"Tom Wolfe","quote":"Only at this point can one begin to understand just how big, how titanic, the ego of the military pilot could","page":44,"location":{"start":555,"end":556},"dateAdded":1726790166},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"Only at this point can one begin to understand just how big, how titanic, the ego of the military pilot could be.","page":44,"location":{"start":555,"end":556},"dateAdded":1726790173},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"It was the drawl of the most righteous of all the possessors of the right stuff: Chuck Yeager.","page":52,"location":{"start":648,"end":649},"dateAdded":1726827685},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"The only trouble they had with Yeager was in holding him back. On his first powered flight in the X–I he immediately executed an unauthorized zero-g roll with a full load of rocket fuel, then stood the ship on its tail and went up to .85 Mach in a vertical climb, also unauthorized.","page":58,"location":{"start":740,"end":742},"dateAdded":1726828378},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"And then, because the military is the training ground for practically all airline pilots, it spread further, until airline passengers all over America began to hear that awshuckin’ driftin’ gone-fishin’ Mud River voice coming from the cockpit … “Now, folks, uh … this is the captain … ummmm … We’ve got a little ol’ red light up here on the control panel that’s tryin’ to tell us that the landin’ gears’re not … uh … lockin’ into position","page":73,"location":{"start":956,"end":960},"dateAdded":1726829280},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"For one of the goodies was the opportunity to buy hand-carved wooden furniture cheaply when you were assigned to the far ends of the earth. That was your opportunity to furnish the living room at last!—and the military would ship it back to the States free of charge.","page":107,"location":{"start":1427,"end":1429},"dateAdded":1726844489},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"Which is to say they were like every group of pilot trainees at every base in America who ever reached that crazed hour of the night when it came time to prove that the right stuff works in all areas of life.","page":169,"location":{"start":2289,"end":2290},"dateAdded":1726970476},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"Glenn had never been afraid to alienate his peers when he knew he was right; perhaps this, too, had always impressed his superiors—and he had never been left behind. His faith in what was right was part of his righteous stuff.","page":178,"location":{"start":2407,"end":2409},"dateAdded":1726990623},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"They would say, “The astronaut has been added to the system as a redundant component.” (A redundant components!)","page":184,"location":{"start":2485,"end":2486},"dateAdded":1726991059},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"So he was not being trained to fly the capsule. He was being trained to ride in","page":189,"location":{"start":2554,"end":2555},"dateAdded":1726991331},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"So he was not being trained to fly the capsule. He was being trained to ride in it.","page":189,"location":{"start":2554,"end":2555},"dateAdded":1726991342},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"Of course, the Cowardly Astronaut routine was also a perfectly acceptable way for bringing up, on the oblique, as it were, the subject of the righteous stuff that the first flight into space would require. But","page":238,"location":{"start":3226,"end":3228},"dateAdded":1727045097},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"about how Gus and his pals had better hurry up or him and his boys would pass them on the way up. Oh, yeah, says Gus, how’s that? Well, says Joe Walker, we’ve got a 57,000-pound rocket engine now, and the Redstone that shoots your little peapod up there only puts out 78,000, so we’re almost up with you—and we fly the damn thing.","page":281,"location":{"start":3829,"end":3832},"dateAdded":1727058232},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"Flying wasn’t a competition like baseball or football. No, in flying any major advance in technology could change the rules.","page":282,"location":{"start":3842,"end":3843},"dateAdded":1727058287},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"His pulse stayed up around 150 throughout the five minutes he was weightless—Shepard’s pulse had never reached 140, not even during liftoff—and went up to 171 during the firing of the retro-rockets before the re-entry through the earth’s atmosphere.","page":283,"location":{"start":3857,"end":3859},"dateAdded":1727058381},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"And he was sheer panic, 160 pounds of it, plus a hundred pounds of death dimes! Lost at last at 2,800 fathoms in the middle of","page":288,"location":{"start":3930,"end":3931},"dateAdded":1727058627},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"And he was sheer panic, 160 pounds of it, plus a hundred pounds of death dimes!","page":288,"location":{"start":3930,"end":3931},"dateAdded":1727058642},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"What the hell had happened to the man? First he had blown the hatch before the lead helicopter could hook on and then he had floundered around out in the ocean and now he was preparing to abandon ship in a goddamned helicopter on a perfectly calm sunny morning out near Bermuda.","page":289,"location":{"start":3944,"end":3946},"dateAdded":1727058712},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"The fact that White was on top of a rocket, the same sort of rocket as the Redstone or the Atlas, the fact that his flight to 217,000 feet was in effect piloted space flight—none of this was likely to impress Kennedy or the public amid the panic over Titov and the space","page":302,"location":{"start":4121,"end":4123},"dateAdded":1727061949},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"The fact that White was on top of a rocket, the same sort of rocket as the Redstone or the Atlas, the fact that his flight to 217,000 feet was in effect piloted space flight—none of this was likely to impress Kennedy or the public amid the panic over Titov and the space gap.","page":302,"location":{"start":4121,"end":4123},"dateAdded":1727061959},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"Under high g’s or low g’s Number 85 could operate a Mercury console like no ape that had ever lived.","page":305,"location":{"start":4155,"end":4156},"dateAdded":1727062203},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"Number 85, smartest of the Simia satyrus, prince of the lower primates, had swallowed so much rage over the past two years, thanks to the operant-conditioning process, it had begun pumping out through his arteries … until every heartbeat was about to blow his eardrums out for him …","page":308,"location":{"start":4206,"end":4208},"dateAdded":1727062490},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"everyone knew that Gus Grissom’s pulse rate had been somewhat panicky . It kept jumping over 100 during the countdown and then spurted up to 150 during the lift-off and stayed that high throughout his weightless flight, then jumped again, all the way to 171, just before the retro-rockets went off. No one—certainly not out loud—no one was going to draw any conclusions from it, but … it was not a sign of the right stuff.","page":319,"location":{"start":4349,"end":4352},"dateAdded":1727063664},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"his pulse never went over 80 and was holding around 70, no more than that of any normal healthy bored man having breakfast in the kitchen.)","page":319,"location":{"start":4354,"end":4355},"dateAdded":1727063682},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"The President took the seven astronauts in to meet his father, and the first one he introduced him to was John.","page":353,"location":{"start":4846,"end":4847},"dateAdded":1727069626},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"He had successfully proved that a man could ride around the earth six times and barely turn a hand or move a muscle and hardly use an ounce of fuel or expend an extra heartbeat and never, not for a moment, surrender to psychological stress, and ride the ship down to a designated drop in the vastness of the ocean. Sigma, summa, Q.E.D.: Operational!","page":389,"location":{"start":5344,"end":5347},"dateAdded":1727146936},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"On the next-to-last orbit, the twenty-first, the automatic control system went out completely. For re-entry Cooper would not only have to establish the capsule’s angle of attack by hand, using the horizon as his point of reference, he would also have to hold the capsule steady on all three axes, pitch, roll, and yaw, with the hand controller and fire the retro-rockets by hand. Meantime, the electrical malfunction had done something to the oxygen balance. Carbon dioxide started building up in the capsule and inside Cooper’s suit and helmet as well. “Well … things are beginning to stack up a little,” said Gordo. It was the same old sod-hut drawl. He sounded like the airline pilot who, having just slipped two seemingly certain mid-air collisions and finding himself in the midst of a radar fuse-out and control-tower dysarthria, says over the intercom: “Well, ladies and gentlemen, we’ll be busy up here in the cockpit making our final approach into Pittsburgh, and so we want to take this opportunity to thank you for flying American and we hope we’ll see you again real soon.” It was second-generation Yeager, now coming from earth orbit. Cooper was having a good time. He knew everybody was in a sweat down below. But this was what he and the boys had wanted all along, wasn’t it? They had wanted to take over the complete re-entry process—become true pilots in this damned thing, bring her in manually—and the engineers had always shuddered at the thought. Well, now they had no other choice, and he had the controls. On top of that, during his final orbit he would have to keep the capsule at the proper angle, by eye, on the night side of the earth and then be ready to fire the retro-rockets soon after he entered daylight over the Pacific. No sweat. Just made it a little more of a sporty course, that was all—and Gordo lined up the capsule, hit the button for the retro-rockets, and splashed down even closer to the carrier Kearsage than Schirra had.","page":411,"location":{"start":5648,"end":5662},"dateAdded":1727158498},{"book":"The Right Stuff","author":"Tom Wolfe","quote":"On August 30 there had gone into service the piece of equipment by which the entire interlude would be remembered: the hotline, a telephone hookup between the White House and the Kremlin, the better to avoid misunderstandings that might result in nuclear war.","page":438,"location":{"start":6012,"end":6013},"dateAdded":1727161301}]