[{"book":"Trust","author":"Hernan Diaz","quote":"Trying to marry religion and science, he became absorbed in the teachings of Emanuel Swedenborg.","page":29,"location":{"start":293,"end":294},"dateAdded":1727246660},{"book":"Trust","author":"Hernan Diaz","quote":"Finding bliss becomes one with the fear of losing","page":57,"location":{"start":617,"end":617},"dateAdded":1727274669},{"book":"Trust","author":"Hernan Diaz","quote":"Finding bliss becomes one with the fear of losing it.","page":57,"location":{"start":617,"end":617},"dateAdded":1727274679},{"book":"Trust","author":"Hernan Diaz","quote":"obsequiousness that would encircle her for the rest of her","page":58,"location":{"start":636,"end":637},"dateAdded":1727275624},{"book":"Trust","author":"Hernan Diaz","quote":"subjects of our victories but only the passive objects of our defeats. We triumph, but it is not really we who fail—we are ruined by forces beyond our control. During the last","page":73,"location":{"start":813,"end":815},"dateAdded":1727311149},{"book":"Trust","author":"Hernan Diaz","quote":"Most of us prefer to believe we are the active subjects of our victories but only the passive objects of our defeats. We triumph, but it is not really we who fail—we are ruined by forces beyond our control.","page":73,"location":{"start":813,"end":814},"dateAdded":1727311154},{"book":"Trust","author":"Hernan Diaz","quote":"The recession that followed the panic left no time for mourning. Clarence had an uncanny ability with numbers. He had his father’s connections. He had a reputable name. He had capital. There was, however, one thing he lacked: social deftness. No enterprise can fully succeed without a true understanding of human behavior. Yet to Clarence finance was a pure mathematical abstraction. This is why, under his guidance, the family entered a period that favored stability over expansion.","page":142,"location":{"start":1557,"end":1561},"dateAdded":1727331759},{"book":"Trust","author":"Hernan Diaz","quote":"The greatest gift I have ever received was my time by her side. She saved me. There is no other way to put it. She saved me with her humanity and her warmth. Saved me with her love of beauty and her kindness. Saved me by making a home for me.","page":158,"location":{"start":1688,"end":1689},"dateAdded":1727332428},{"book":"Trust","author":"Hernan Diaz","quote":"was swiftly demolished, and we broke ground at once. During this part of the project Mildred and I moved up to La Fiesolana. She was delighted. Having spent so much time in","page":162,"location":{"start":1727,"end":1728},"dateAdded":1727368286},{"book":"Trust","author":"Hernan Diaz","quote":"Every life is organized around a small number of events that either propel us or bring us to a grinding halt. We spend the years between these episodes benefiting or suffering from their consequences until the arrival of the next forceful moment.","page":173,"location":{"start":1842,"end":1844},"dateAdded":1727420490},{"book":"Trust","author":"Hernan Diaz","quote":"It was a classic example of the state’s attempting to correct artificially a situation the market would have rectified naturally, if only left to operate freely.","page":183,"location":{"start":1955,"end":1956},"dateAdded":1727422015},{"book":"Trust","author":"Hernan Diaz","quote":"the Emergency Quota Act, signed into law by President Harding in 1921, effectively limiting the influx of Italian immigrants while still welcoming people from northern Europe, followed by the even more stringent Immigration Act of 1924, signed by Coolidge;","page":209,"location":{"start":2196,"end":2198},"dateAdded":1727536475},{"book":"Trust","author":"Hernan Diaz","quote":"lived with my father for over twenty years, and we stayed close after I moved out. Not once, in all those decades, did he apologize to me for anything.","page":272,"location":{"start":2940,"end":2941},"dateAdded":1727588667},{"book":"Trust","author":"Hernan Diaz","quote":"I lived with my father for over twenty years, and we stayed close after I moved out. Not once, in all those decades, did he apologize to me for anything.","page":272,"location":{"start":2940,"end":2941},"dateAdded":1727588677},{"book":"Trust","author":"Hernan Diaz","quote":"“She saved me. No other way to put it. Saved me with her humanity and warmth. Saved me by making a home for me. You probably can’t see it now, but this place,” he rolled his hands in gentle waves around him, “felt like a home once. Now, with each passing day, it becomes more and more like a museum. Hard. But this was a soft place not too long ago. She . . . Mildred had . . . There was always music. She was . . . We should talk about that. There was always music.” Again, he was at a loss for words. “Beauty. Yes. She was a lover of beauty. And kindness. Beauty and kindness. That’s what she loved. And . . . It’s what she brought to the world. She would always","page":276,"location":{"start":2980,"end":2985},"dateAdded":1727597683},{"book":"Trust","author":"Hernan Diaz","quote":"What all tendencies, branches and splinters of anarchism—and there are quite a few—have in common is their opposition to every form of hierarchy and inequality. It should not be surprising, then, that there are no extensive records of the movement, since the institutional order required to keep such records was in obvious contradiction with the movement’s tenets.","page":282,"location":{"start":3060,"end":3063},"dateAdded":1727598908},{"book":"Trust","author":"Hernan Diaz","quote":"Mystery Men of Wall Street by Earl Sparling. Having grown up on detective fiction, I found the title immediately appealing. It was a collection of portraits of financiers, written in 1929. Jesse Livermore, William Durant, the Fisher brothers, Arthur Cutten, Andrew Bevel . . . They were all in there.","page":310,"location":{"start":3411,"end":3414},"dateAdded":1727764280},{"book":"Trust","author":"Hernan Diaz","quote":"The question about who she might have been never stopped plaguing me. She could not have been the haunted woman in Vanner’s last chapters. And I always knew she was not the insubstantial shadow in Bevel’s unfinished memoir.","page":356,"location":{"start":3996,"end":3997},"dateAdded":1727830903},{"book":"Trust","author":"Hernan Diaz","quote":"Andrew back. Happy with outcome in Z, which he now (as usual) describes as the result of his “intuition.”","page":376,"location":{"start":4161,"end":4162},"dateAdded":1727831622},{"book":"Trust","author":"Hernan Diaz","quote":"We complemented each other. He understood he’d never be able to uphold the myth forming around him without my help. I understood I’d never be allowed to operate at such heights if it wasn’t through him. For a while, we both enjoyed this alliance.","page":381,"location":{"start":4222,"end":4224},"dateAdded":1727837640}]