[
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "I've never been one to dwell on reverses, and I didn't do so then. It's not just a corny saying that you can make a positive out of most any negative if you work at it hard enough. I've always thought of problems as challenges, and this one wasn't any different. I don't know if that experience changed me or not. I know I read my leases a lot more carefully after that, and maybe I became a little more wary of just how tough the world can",
    "page": 43,
    "location": {
      "start": 706,
      "end": 709
    },
    "dateAdded": 1731674865
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "Then I went somewhere to look at what Sterling Stores was doing—most everything I've done I've copied from somebody else—and saw these all-metal fixtures.",
    "page": 51,
    "location": {
      "start": 816,
      "end": 817
    },
    "dateAdded": 1731675296
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "This is a big contradiction in my makeup that I don't completely understand to this day. In many of my core values—things like church and family and civic leadership and even politics—I'm a pretty conservative guy. But for some reason in business, I have always been driven to buck the system, to innovate, to take things beyond where they've been. On the one hand, in the community, I really am an",
    "page": 62,
    "location": {
      "start": 1002,
      "end": 1005
    },
    "dateAdded": 1731797018
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "This is a big contradiction in my makeup that I don't completely understand to this day. In many of my core values—things like church and family and civic leadership and even politics—I'm a pretty conservative guy. But for some reason in business, I have always been driven to buck the system, to innovate, to take things beyond where they've been. On the one hand, in the community, I",
    "page": 62,
    "location": {
      "start": 1002,
      "end": 1005
    },
    "dateAdded": 1731797032
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "This is a big contradiction in my makeup that I don't completely understand to this day. In many of my core values—things like church and family and civic leadership and even politics—I'm a pretty conservative guy. But for some reason in business, I have always been driven to buck the system, to innovate, to take things beyond where they've been.",
    "page": 62,
    "location": {
      "start": 1002,
      "end": 1004
    },
    "dateAdded": 1731797043
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "spent some time thinking about merchandising. I suspect I have emphasized item merchandising and the importance of promoting items to a greater degree than most any other",
    "page": 72,
    "location": {
      "start": 1157,
      "end": 1159
    },
    "dateAdded": 1731878562
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "spent some time thinking about merchandising. I suspect I have emphasized item merchandising and the importance of promoting items to a greater degree than most any other",
    "page": 72,
    "location": {
      "start": 1157,
      "end": 1159
    },
    "dateAdded": 1731878567
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "suspect I have emphasized item merchandising and the importance of promoting items to a greater degree than most any other retail management person in this country.",
    "page": 73,
    "location": {
      "start": 1158,
      "end": 1159
    },
    "dateAdded": 1731878571
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "I really love to pick an item—maybe the most basic merchandise—and then call attention to it. We used to say you could sell anything if you hung it from the ceiling.",
    "page": 73,
    "location": {
      "start": 1160,
      "end": 1161
    },
    "dateAdded": 1731878588
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "In retail, you are either operations driven—where your main thrust is toward reducing expenses and improving efficiency—or you are merchandise driven. The ones that are truly merchandise driven can always work on improving operations. But the ones that are operations driven tend to level off and begin to deteriorate. So Sam's item promotion mania is a great game and we all have a lot of fun with it, but it is also at the heart of what creates our extraordinary high sales per square foot, which enable us to dominate our competition.\"",
    "page": 78,
    "location": {
      "start": 1240,
      "end": 1244
    },
    "dateAdded": 1731879121
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "We paid absolutely no attention whatsoever to the way things were supposed to be done, you know, the way the rules of retail said it had to be done.",
    "page": 80,
    "location": {
      "start": 1272,
      "end": 1273
    },
    "dateAdded": 1731879215
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "If you want the people in the stores to take care of the customers, you have to make sure you're taking care of the people in the stores. That's the most important single ingredient of Wal-Mart's success.",
    "page": 98,
    "location": {
      "start": 1545,
      "end": 1546
    },
    "dateAdded": 1732270237
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "And this is a very important point: without the computer, Sam Walton could not have done what he's done. He could not have built a retailing empire the size of what he's built, the way he built",
    "page": 105,
    "location": {
      "start": 1650,
      "end": 1651
    },
    "dateAdded": 1732270978
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "And this is a very important point: without the computer, Sam Walton could not have done what he's done. He could not have built a retailing empire the size of what he's built, the way he built it. He's",
    "page": 105,
    "location": {
      "start": 1650,
      "end": 1651
    },
    "dateAdded": 1732270994
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "consider the time Ron was at the company, from 1968 until 1976 (when he left under some fairly unpleasant circumstances for both of us), to be the most important period of development in Wal-Mart's history. We",
    "page": 109,
    "location": {
      "start": 1715,
      "end": 1716
    },
    "dateAdded": 1732271301
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "We have a group of longtime investors in Scotland who have done it better maybe than anybody.",
    "page": 125,
    "location": {
      "start": 1962,
      "end": 1962
    },
    "dateAdded": 1732273074
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "When people want to simplify the Wal-Mart story, that's usually how they sum up the secret of our success: \"Oh, they went into small towns when nobody else would.\"",
    "page": 130,
    "location": {
      "start": 2034,
      "end": 2035
    },
    "dateAdded": 1732273382
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "So my role has been to pick good people and give them the maximum authority and responsibility.",
    "page": 137,
    "location": {
      "start": 2129,
      "end": 2129
    },
    "dateAdded": 1733012366
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "the truth is that none of that is the real secret to our unbelievable prosperity. What has carried this company so far so fast is the relationship that we, the managers, have been able to enjoy with our associates. By \"associates\" we mean those employees out in the stores and in the distribution centers and on the trucks who generally earn an hourly wage for all their hard work. Our relationship with the associates is a partnership in the truest sense. It's the only reason our company has been able to consistently outperform the competition—and even our own expectations.",
    "page": 149,
    "location": {
      "start": 2317,
      "end": 2321
    },
    "dateAdded": 1733095266
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "Also, some of my best friends are people who like to hunt quail. I'm extremely prejudiced, but I feel like quail hunters are generally good sportsmen who've got a balanced respect for conservation",
    "page": 172,
    "location": {
      "start": 2682,
      "end": 2683
    },
    "dateAdded": 1733183046
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "Also, some of my best friends are people who like to hunt quail. I'm extremely prejudiced, but I feel like quail hunters are generally good sportsmen who've got a balanced respect for conservation and wildlife: things that I certainly value.",
    "page": 172,
    "location": {
      "start": 2682,
      "end": 2684
    },
    "dateAdded": 1733183053
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "What happened then is the one period in Wal-Mart's history that I am still the least comfortable talking about today. But everybody else has had their say on the subject so I'm going to explain the events the way I saw them unfold and be done with",
    "page": 174,
    "location": {
      "start": 2708,
      "end": 2709
    },
    "dateAdded": 1733183190
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "We had Whitaker, straight out of the get-after-it-and-stay-after-it old school, to help us get started; Ferold Arend, a methodical, hardworking German, to get us organized; Ron Mayer, a whiz at computers, to get our systems going; Jack Shewmaker, a brilliant shoot-from-the-hip executive with a store managers mentality, to blow us out of ruts and push us into new ideas we needed to be working with; and David Glass, who could step up in a crisis, keep his cool, and eventually get control of a company that became so big it was hard to comprehend.",
    "page": 180,
    "location": {
      "start": 2798,
      "end": 2802
    },
    "dateAdded": 1733183632
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "know most companies don't have cheers, and most board chairmen probably wouldn't lead them even if they did. But then most companies don't have folks like Mike \"Possum\" Johnson, who entertained us one Saturday morning back when he was safety director by taking on challengers in a no-holds-barred persimmon-seed-spitting contest, using Robert Rhoads, our company general counsel, as the official target.",
    "page": 183,
    "location": {
      "start": 2843,
      "end": 2846
    },
    "dateAdded": 1733183780
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "After the meeting, Helen and I invite all the associates who attend—about 2,500 of them—over to our house for a big picnic lunch catered by our own Wal-Mart cafeteria.",
    "page": 195,
    "location": {
      "start": 3027,
      "end": 3028
    },
    "dateAdded": 1733271717
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "And, of course, we write a detailed account of the meeting in our company newspaper, Wal-Mart World, so everybody gets a chance to read exactly what we did.",
    "page": 196,
    "location": {
      "start": 3036,
      "end": 3037
    },
    "dateAdded": 1733271742
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "So I've made it my own personal mission to ensure that constant change is a vital part of the Wal-Mart culture itself.",
    "page": 196,
    "location": {
      "start": 3043,
      "end": 3044
    },
    "dateAdded": 1733352973
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "I like to keep everybody guessing. I don't want our competitors getting too comfortable with feeling like they can predict what we're going to do. And I don't want our own executives feeling that way either. It's part of my strong feeling for the necessity of constant change, for keeping people a little off balance.",
    "page": 233,
    "location": {
      "start": 3601,
      "end": 3603
    },
    "dateAdded": 1734046210
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "Many people have contributed over the years, but David Glass has to get the lion's share of the credit for where we are today in distribution.",
    "page": 237,
    "location": {
      "start": 3660,
      "end": 3661
    },
    "dateAdded": 1734046524
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "\"When you own and manage your distribution and logistics channel, you have a great competitive advantage over companies that rely on third-party suppliers. It automatically shortens your lead times, but also you can constantly look for ways to improve your operation and try to make it more efficient.",
    "page": 239,
    "location": {
      "start": 3693,
      "end": 3695
    },
    "dateAdded": 1734046723
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "he knows he's an ambassador of Wal-Mart and everything we stand for out on the road. I'll just say it: we have the best damned truck drivers in America, and their loyalty and their can-do attitude have made a huge difference to this company.",
    "page": 240,
    "location": {
      "start": 3708,
      "end": 3709
    },
    "dateAdded": 1734046812
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "We've spent almost $700 million building up the current computer and satellite systems we have. I'm told it's the largest civilian data base of its kind in the world—even bigger than AT&T's.",
    "page": 244,
    "location": {
      "start": 3770,
      "end": 3771
    },
    "dateAdded": 1734047155
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "But when you see all those satellite dishes outside our building, or hear about all the computers inside it, or look at some videotape of our laser-guided distribution centers, don't let anybody kid you. Without the right managers, and the dedicated associates and truck drivers all across the system, all that stuff is totally worthless.",
    "page": 245,
    "location": {
      "start": 3787,
      "end": 3789
    },
    "dateAdded": 1734047317
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "One way I've approached this is by sticking to the same formula I used back when we had about five stores. In those days, I tried to operate on a 2 percent general office expense structure. In other words, 2 percent of sales should have been enough to carry our buying office, our general office expense, my salary, Bud's salary—and after we started adding district managers or any other officers—their salaries too. Believe it or not, we haven't changed that basic formula from five stores to two thousand stores. In fact, we are actually operating at a far lower percentage today in office overhead than we did thirty years ago, and that includes tremendous expenses for computer support and distribution center support—though not the actual cost of running the distribution centers. Really, it includes everything that we supply centrally in the way of support for the stores.",
    "page": 263,
    "location": {
      "start": 4075,
      "end": 4081
    },
    "dateAdded": 1734306119
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "\"If you don't zero in on your bureaucracy every so often, you will naturally build in layers. You never set out to add bureaucracy. You just get it. Period. Without even knowing it. So you always have to be looking to eliminate it.",
    "page": 264,
    "location": {
      "start": 4092,
      "end": 4093
    },
    "dateAdded": 1734306224
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "\"I believe that every right implies a responsibility; every opportunity an obligation; every possession a duty.\" —JOHN D. ROCKEFELLER, JR.",
    "page": 267,
    "location": {
      "start": 4123,
      "end": 4125
    },
    "dateAdded": 1734306432
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "That's $13 billion which is a product of a free market system that allows us to operate efficiently, and it's the reason our customers love us so.",
    "page": 273,
    "location": {
      "start": 4221,
      "end": 4222
    },
    "dateAdded": 1734475485
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "If we only saved our customers 10 percent over what they would be paying if we weren't there—and I think that's very conservative—that would be $13 billion we've saved them. That's $13 billion which is a product of a free market system that allows us to operate efficiently, and it's the reason our customers love us so.",
    "page": 273,
    "location": {
      "start": 4220,
      "end": 4222
    },
    "dateAdded": 1734475493
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "What we learned was that we had fallen into a pattern of knee-jerk import buying without really examining possible alternatives.",
    "page": 275,
    "location": {
      "start": 4255,
      "end": 4256
    },
    "dateAdded": 1734475670
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "\"One thing you'll notice if you spend very much time talking with Sam about Wal-Mart's success. He's always saying things like 'This was the key to the whole thing,' or That was our real secret.' He knows as well as anyone that there wasn't any magic formula. A lot of different things made it work, and in one day's time he may cite all of them as the 'key' or the 'secret.' What's amazing is that for almost fifty years he's managed to focus on all of them at once—all the time. That's his real secret.\"",
    "page": 279,
    "location": {
      "start": 4299,
      "end": 4303
    },
    "dateAdded": 1734475914
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "these rules are not in any way intended to be the Ten Commandments of Business. They are some rules that worked for me. But I always prided myself on breaking everybody else's rules, and I always favored the mavericks who challenged my rules. I may have fought them all the way, but I respected them, and, in the end, I listened to them a lot more closely than I did the pack who always agreed with everything I said.",
    "page": 280,
    "location": {
      "start": 4321,
      "end": 4324
    },
    "dateAdded": 1734476038
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "The truth is that if I hadn't gotten sick, I doubt I would have written this book, or taken the time to try to sort my life out.",
    "page": 284,
    "location": {
      "start": 4392,
      "end": 4393
    },
    "dateAdded": 1734476276
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "The truth is that if I hadn't gotten sick, I doubt I would have written this book, or taken the time to try to sort my life out. As you now know, temperamentally, I'm much too biased toward action to undertake such a sedentary project. But since I have, I'm going to go all the way and try to share with you how I feel",
    "page": 284,
    "location": {
      "start": 4392,
      "end": 4394
    },
    "dateAdded": 1734476290
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "The truth is that if I hadn't gotten sick, I doubt I would have written this book, or taken the time to try to sort my life out. As you now know, temperamentally, I'm much too biased toward action to undertake such a sedentary project. But since I have, I'm going to go all the way and try to share with you how I feel about some things that seem important to me.",
    "page": 284,
    "location": {
      "start": 4392,
      "end": 4394
    },
    "dateAdded": 1734476360
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "Here's how I look at it: my life has been a tradeoff.",
    "page": 285,
    "location": {
      "start": 4404,
      "end": 4405
    },
    "dateAdded": 1734476469
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "Here's how I look at it: my life has been a tradeoff. If I wanted to reach the goals I set for myself, I had to get at it and stay at it every day. I had to think about it all the time.",
    "page": 285,
    "location": {
      "start": 4404,
      "end": 4406
    },
    "dateAdded": 1734476487
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "lazy. In the future, free enterprise is going to have to be done well—which means it benefits the workers, the stockholders, the communities, and, of course, management, which must adopt a philosophy of servant leadership.",
    "page": 288,
    "location": {
      "start": 4439,
      "end": 4441
    },
    "dateAdded": 1734476811
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "Recently, I don't think there's any doubt that a lot of American management has bent over too far toward taking care of itself first, and worrying about everybody else later. The Japanese are right on this point: you can't create a team spirit when the situation is so onesided,",
    "page": 288,
    "location": {
      "start": 4442,
      "end": 4443
    },
    "dateAdded": 1734476825
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "But if American management is going to say to their workers that we're all in this together, they're going to have to stop this foolishness of paying themselves $3 million and $4 million bonuses every year and riding around everywhere in limos and corporate jets like they're so much better than everybody else.",
    "page": 290,
    "location": {
      "start": 4472,
      "end": 4474
    },
    "dateAdded": 1734477092
  },
  {
    "book": "Sam Walton - Made in America",
    "author": "Sam Walton",
    "quote": "Then, less than three weeks after receiving the Medal of Freedom, and just days after his seventy-fourth birthday, Dad's struggle with cancer finally ended. On Sunday morning, April 5, he died peacefully—as inspirational in facing death as he had been in facing life. We will all miss him.",
    "page": 295,
    "location": {
      "start": 4539,
      "end": 4541
    },
    "dateAdded": 1734477442
  }
]
