{
  "title": "My Book Shelf",
  "introHtml": "<p>I enjoy reading books<b> </b>but I often forget what I&#39;ve read weeks or months afterwards. This list is an effort to remember what I&#39;ve read and can hopefully help others find a good book. </p><p>This page will be updated continuously.</p>",
  "books": [
    {
      "title": "Jurassic Park",
      "author": "Michael Crichton",
      "dateFinished": "16/08/2025",
      "descriptionHtml": "<p>Really movie-like book. Great sci-fi. Velociraptors are <i>smart</i> man.</p>",
      "year": "2025"
    },
    {
      "title": "Giovanni's Room",
      "author": "James Baldwin",
      "dateFinished": "13/07/2025",
      "descriptionHtml": "<p>A gay gay gay love story in Paris. </p><blockquote><p>I trace it to something as fleeting as the tip of her breast lightly touching my forearm as she leaned over me to serve my supper. I felt my flesh recoil.</p></blockquote><blockquote><p>and when I entered her I began to feel that I would never get out alive. All that had once delighted me seemed to have turned sour on my stomach.</p></blockquote><p></p>",
      "year": "2025"
    },
    {
      "title": "Stoner",
      "author": "John Edward Williams",
      "dateFinished": "28/06/2025",
      "descriptionHtml": "<p>A story about a pretty sad guy who stayed in academia his whole life. Also had a married someone he didn&#39;t really like and had a daughter. Kind of a <b><i>downer</i></b> this one.</p><blockquote><p>&quot;Maybe I do,&quot; Masters said. &quot;But bad as we are, we&#39;re better than those on the outside, in the muck, the poor bastards of the world. We do no harm, we say what we want, and we get paid for it; and that&#39;s a triumph of natural virtue, or pretty damn close to it.&quot;</p></blockquote><p></p>",
      "year": "2025"
    },
    {
      "title": "True Grit",
      "author": "Charles Portis",
      "dateFinished": "17/04/2025",
      "descriptionHtml": "<p>Another solid western ✅</p><blockquote><p>His weight was such that the bunk was bowed in the middle almost to the floor. It looked like he was in a hammock.</p></blockquote><p></p>",
      "year": "2025"
    },
    {
      "title": "Lonesome Dove",
      "author": "Larry McMurtry",
      "dateFinished": "11/03/2025",
      "descriptionHtml": "<p>I wrote about this book <a href=\"https://www.newsletter.kahvipatel.com/i/158964451/lonesome-dove\" target=\"_blank\">in the newsletter!</a></p><blockquote><p>“Son, this is a sad thing,” Augustus said. “Loss of life always is. But the life is lost for good. Don’t you go attempting vengeance…He went over and tightened the girth on his saddle. “Don’t be trying to give back pain for pain,” he said. “You can’t get even measures in business like this. You best go find your wife.”</p></blockquote><blockquote><p>He and Augustus had discussed the question of leadership many times. “It ain’t complicated,” Augustus maintained. “Most men doubt their own abilities. You don’t. It’s no wonder they want to keep you around. It keeps them from having to worry about failure all the time.”</p></blockquote><p>More highlights <a href=\"https://kahvipatel.com/highlights/lonesome_dove\" >here</a>.</p><p></p>",
      "year": "2025"
    },
    {
      "title": "Rage",
      "author": "Bob Woodward",
      "dateFinished": "29/01/2025",
      "descriptionHtml": "<p>Oof. Highlights <a href=\"https://kahvipatel.com/highlights/rage\" >here</a>.</p>",
      "year": "2025"
    },
    {
      "title": "Sam Walton: Made In America",
      "author": "Sam Walton",
      "dateFinished": "15/11/2024",
      "descriptionHtml": "<p>This book tells the story of the late Sam Walton out of Arkansas and how he built the company from scratch. Walmart, at time of writing, is the largest company in the world by <a href=\"https://en.wikipedia.org/wiki/List_of_largest_companies_by_revenue\" target=\"_blank\">revenue</a> <i>and</i> <a href=\"https://en.wikipedia.org/wiki/List_of_largest_employers\" target=\"_blank\">employees</a> - around <b>2 million people</b>.</p><p>It’s a special book too as he started writing it after he was diagnosed with multiple myeloma.</p><blockquote><p>The truth is that if I hadn&#39;t gotten sick, I doubt I would have written this book, or taken the time to try to sort my life out. As you now know, temperamentally, I&#39;m much too biased toward action to undertake such a sedentary project.</p></blockquote><p>I was struck by how opposite it felt to Walter Isaacson’s biography of <a href=\"https://www.goodreads.com/book/show/122765395-elon-musk\" target=\"_blank\">Elon Musk</a>. Both are entrepreneurs and business magnates, but there’s so much more warmth and humanity in Sam’s story. More talk of people, relationships, community (at least the way he tells it).</p><p>His stance on CEO compensation is refreshing!</p><blockquote><p>if American management is going to say to their workers that we&#39;re all in this together, they&#39;re going to have to stop this foolishness of paying themselves $3 million and $4 million bonuses every year and riding around everywhere in limos and corporate jets like they&#39;re so much better than everybody else.</p></blockquote><p>And the way he talks about hourly employees:</p><blockquote><p>If you want the people in the stores to take care of the customers, you have to make sure you&#39;re taking care of the people in the stores. That&#39;s the most important single ingredient of Wal-Mart&#39;s success.</p></blockquote><p>He and his wife would host a few thousand of them at their house every year:</p><blockquote><p>After the meeting, Helen and I invite all the associates who attend—about 2,500 of them—over to our house for a big picnic lunch catered by our own Wal-Mart cafeteria.</p></blockquote><p>He’s was also a fan of this idea of constant change:</p><blockquote><p>I like to keep everybody guessing. I don&#39;t want our competitors getting too comfortable with feeling like they can predict what we&#39;re going to do. And I don&#39;t want our own executives feeling that way either. It&#39;s part of my strong feeling for the necessity of constant change, for keeping people a little off balance.</p></blockquote><p>I agree with this! Change is good, it keeps us sharp. That said, on a personal level, it’s hard to build deep connections with people when they’re always changing.</p><blockquote><p>This is a big contradiction in my makeup that I don&#39;t completely understand to this day. In many of my core values—things like church and family and civic leadership and even politics—I&#39;m a pretty conservative guy. But for some reason in business, I have always been driven to buck the system, to innovate, to take things beyond where they&#39;ve been.</p></blockquote><p>And, along those lines, Sam has some humility about what it took to grow the company.</p><blockquote><p>Here&#39;s how I look at it: my life has been a tradeoff. If I wanted to reach the goals I set for myself, I had to get at it and stay at it every day. I had to think about it all the time.</p></blockquote><p>Finally, he was awarded the Medal of Freedom about three weeks before he died. The following is from the postscript written by his son:</p><blockquote><p>The award was presented on the morning of Tuesday, March 17, in the auditorium of the Wal-Mart general offices. The room was filled with several hundred of his associates, and their affection for Dad on this special day was particularly moving. I think they may even have startled President and Mrs. Bush—not to mention the White House press corps—by giving one of the most enthusiastic Wal-Mart cheers we&#39;ve heard around here in some time. Dad&#39;s pleasure was evident, and he called it &quot;the highlight of our entire career.&quot; Of course, he shared all the credit with his associates. But it was a poignant day. He had to be rolled onto the stage in a wheelchair, and I think most of the associates sensed that it would be their last get-together with him.</p><p>…</p><p>less than three weeks after receiving the Medal of Freedom, and just days after his seventy-fourth birthday, Dad&#39;s struggle with cancer finally ended. On Sunday morning, April 5, he died peacefully—as inspirational in facing death as he had been in facing life. We will all miss him.</p></blockquote><p>More highlights are <a href=\"https://kahvipatel.com/highlights/walmart/\" >here</a>.</p>",
      "year": "2024"
    },
    {
      "title": "Trust",
      "author": "Hernan Diaz",
      "dateFinished": "02/10/2024",
      "descriptionHtml": "<p>An interesting mix of narratives coalescing around two figures - a banker and his wife in 1920s. It&#39;s quite intricate but entertaining. I think the first part was my favourite of the three. Highlights <a href=\"https://kahvipatel.com/highlights/trust\" >here</a>.</p><blockquote><p>The greatest gift I have ever received was my time by her side. She saved me. There is no other way to put it. She saved me with her humanity and her warmth. Saved me with her love of beauty and her kindness. Saved me by making a home for me.</p></blockquote><blockquote><p>Every life is organized around a small number of events that either propel us or bring us to a grinding halt. We spend the years between these episodes benefiting or suffering from their consequences until the arrival of the next forceful moment.</p></blockquote><p></p>",
      "year": "2024"
    },
    {
      "title": "The Right Stuff",
      "author": "Tom Wolfe",
      "dateFinished": "24/09/2024",
      "descriptionHtml": "<p>If anyone wants an interesting, cowboyish recounting of America&#39;s first astronauts, this is the book for you. It&#39;s very Top Gun-esque. </p><p>The &quot;Right Stuff&quot; in this case refers to that ephemeral quality that all fighter pilots must have, but can&#39;t describe. You just know it when you see it. You just gotta have <i>the</i> <i>stuff</i>. Highlights <a href=\"https://kahvipatel.com/highlights/the_right_stuff\" >here</a>.</p><blockquote><p>Only at this point can one begin to understand just how big, how titanic, the ego of the military pilot could be.</p></blockquote><blockquote><p>The only trouble they had with Yeager was in holding him back. On his first powered flight in the X–I he immediately executed an unauthorized zero-g roll with a full load of rocket fuel, then stood the ship on its tail and went up to .85 Mach in a vertical climb, also unauthorized.</p></blockquote><blockquote><p>Cooper was having a good time. He knew everybody was in a sweat down below. But this was what he and the boys had wanted all along, wasn’t it? They had wanted to take over the complete re-entry process—become true pilots in this damned thing, bring her in manually—and the engineers had always shuddered at the thought. Well, now they had no other choice, and he had the controls.</p></blockquote><p></p>",
      "year": "2024"
    },
    {
      "title": "Mother of God (Madre de Dios)",
      "author": "Paul Rosolie",
      "dateFinished": "10/08/2024",
      "descriptionHtml": "<p>This is a book about the Amazon written by a conservationist - Paul Rosolie. This guy loves the jungle. LOVES it.</p><p>The amount of incredible things happening in the Amazon jungle makes the book quite engaging. Paul also enjoys doing crazy things - he comes close to dying on several  different occasions.</p><p>It all makes for a quick and entertaining read. </p><blockquote><p>The Native American adage that “we do not inherit the earth from our ancestors, we borrow it from our children” is more relevant today than ever.</p></blockquote><p></p>",
      "year": "2024"
    },
    {
      "title": "The Defining Decade: Why Your Twenties Matter",
      "author": "Meg Jay",
      "dateFinished": "19/07/2024",
      "descriptionHtml": "<p>I mentioned this book to two of my 40 year old co-workers. I said “I’m reading a book about the importance of your twenties”. They looked a bit solemn and nodded. The staff developer said “<b>Yeah, your twenties really set the tone</b>” -- this is essentially the thesis of the book.</p><p>One of the most compelling arguments supporting that thesis is that we mostly stop changing past 30:</p><blockquote><p>there has been a spirited debate among personality researchers about whether people change after age thirty. Numerous studies have shown that, relatively speaking, we don’t. After thirty, our thoughts and feelings and behaviors remain incredibly stable.</p></blockquote><p>Therefore, creating good habits in your twenties is important:</p><blockquote><p>Never again will we be so quick to learn new things. Never again will it be so easy to become the people we hope to be. So whatever it is we want to change about ourselves, our twenties are the easiest time to change it.</p></blockquote><p>It&#39;s certainly up for debate which habits will actually help you be happier in the future. But the key take away, for me, is to be<i> intentional</i>.</p><p>Highlights <a href=\"https://kahvipatel.com/highlights/defining_decade\" >here</a>.</p><p></p>",
      "year": "2024"
    },
    {
      "title": "The Rise of Endymion",
      "author": "Dan Simmons",
      "dateFinished": "04/07/2024",
      "descriptionHtml": "<p>The fantastic conclusion to the Hyperion Cantos. Loved Anea&#39;s journey. Most loose ends were tied up!</p><p>Highlights <a href=\"https://kahvipatel.com/highlights/hyperion_cantos\" >here</a>.</p>",
      "year": "2024"
    },
    {
      "title": "Endurance: Shackleton's Incredible Voyage",
      "author": "Alfred Lansing",
      "dateFinished": "19/05/2024",
      "descriptionHtml": "<p>This book is the foremost account of Ernest Shackleton&#39;s 1912 expedition to reach the South Pole. Spoiler alert: <i>Things did not go according to plan</i>.</p><p>It&#39;s a fascinating account of having control over your own destiny. The whole crew was stranded in the most barren landscape on Earth and somehow they managed to escape with no casualties.</p><p>The book was first published in 1959 making one of the older books I&#39;ve read.</p><blockquote><p>But the sea is a different sort of enemy. Unlike the land, where courage and the simple will to endure can often see a man through, the struggle against the sea is an act of physical combat, and there is no escape. It is a battle against a tireless enemy in which man never actually wins; the most that he can hope for is not to be defeated.</p></blockquote><p></p>",
      "year": "2024"
    },
    {
      "title": "Jarhead",
      "author": "Anthony Swofford",
      "dateFinished": "26/04/2024",
      "descriptionHtml": "<p>The story of a marine&#39;s deployment to the Gulf War in Iraq in 1990-91. It&#39;s quite a personal story. The author is a good writer and makes most of this book easily digestible. Gives a detailed look into the American Military, at least from the lower ranks. It makes clear how the logistical efficiency of the military comes at the expense of individual freedom (maybe that was already obvious). </p><blockquote><p>Some wars are unavoidable and need well be fought, but this doesn&#39;t erase warfare&#39;s waste. Sorry, we must say to the mothers whose son&#39;s die horribly. This will never end. Sorry.</p></blockquote><p></p>",
      "year": "2024"
    },
    {
      "title": "Consider Phlebas",
      "author": "Iain M. Banks",
      "dateFinished": "30/03/2024",
      "descriptionHtml": "<p>Another space-opera. Gritty and science-y and fun. Does a great job at describing a civilization governed by machines (AI). I think the protagonist is charming.</p><p>I&#39;m going to read the next one in this series. </p><blockquote><p>There were in excess of eighteen trillion people in the Culture, just about every one of them well nourished, extensively educated and mentally alert, and only thirty or forty of them had this unusual ability to forecast and assess on a par with a well-informed Mind (of which there were already many hundreds of thousands). It was not impossible that this was pure luck; toss eighteen trillion coins in the air for a while and a few of them are going to keep landing the same side up for a long, long time.</p></blockquote><p>Highlights <a href=\"https://kahvipatel.com/highlights/consider_phlebas\" >here</a>.</p>",
      "year": "2024"
    },
    {
      "title": "Endymion",
      "author": "Dan Simmons",
      "dateFinished": "30/03/2024",
      "descriptionHtml": "<p>The third book in Hyperion Cantos. I found the whole chase element very entertaining. This series continues to impress and I&#39;ll be reading the fourth and final installment of the series soon.</p>",
      "year": "2024"
    },
    {
      "title": "All the Shah's Men",
      "author": "Stephen Kinzer",
      "dateFinished": "23/01/2024",
      "descriptionHtml": "<p>I wrote about this book <a href=\"https://www.newsletter.kahvipatel.com/i/143627439/iran\" target=\"_blank\">in my newsletter</a>. My highlights are <a href=\"https://kahvipatel.com/highlights/all_the_shahs_men/\" >here</a>.</p>",
      "year": "2024"
    },
    {
      "title": "Dilla Time",
      "author": "Dan Charnas",
      "dateFinished": "20/01/2024",
      "descriptionHtml": "<p>Such a cool book. Put me onto the <a href=\"https://en.wikipedia.org/wiki/Soulquarians\" target=\"_blank\">Soulquarians</a> which I am forever grateful for. Especially Erykah Badu, D’Angelo and Slum Village.</p><p>J-Dilla definitely was not perfect, but the music he created was unique and something to be recognized.</p><blockquote><p>Fucking around is the whole point. Glasper imagined John Coltrane returning to the earthly plane decades after his death, walking into a jazz club to witness a bunch of musicians, all playing like John Coltrane, and saying: I did all my work and died for this?</p></blockquote><p>Highlights <a href=\"https://kahvipatel.com/highlights/dillatime/\" >here</a>.</p><p></p>",
      "year": "2024"
    },
    {
      "title": "Going Infinite",
      "author": "Michael Lewis",
      "dateFinished": "28/10/2023",
      "descriptionHtml": "<p>The story of Sam Bankman-Fried and FTX. It&#39;s the fastest I&#39;ve read a book in a while. Michael Lewis never fails to make narratives enthralling. And this one doesn&#39;t need any embellishment. It&#39;s just a crazy story. A bunch of neurodivergent kids playing around with millions of dollars.</p>",
      "year": "2023"
    },
    {
      "title": "Elon Musk",
      "author": "Walter Isaacson",
      "dateFinished": "11/10/2023",
      "descriptionHtml": "<p>This was an interesting one. I wrote about it <a href=\"https://www.newsletter.kahvipatel.com/i/138935536/tech-billionaires\" target=\"_blank\">in the newsletter</a>. I would recommend reading this if you&#39;re interested/entertained by the Elon news cycle. It&#39;s a cool behind the scenes. </p><blockquote><p>His hot-shot lawyer Alex Spiro argued to the jury, “Elon Musk is just an impulsive kid with a terrible Twitter habit.”</p></blockquote><blockquote><p>When the dust settled, about 75 percent of the Twitter workforce had been cut. There were just under eight thousand employees when Musk took over on October 27. By mid-December, there were just over two thousand. Musk had wrought one of the greatest shifts in corporate culture ever. Twitter had gone from being among the most nurturing workplaces, replete with free artisanal meals and yoga studios and paid rest days and concern for “psychological safety,” to the other extreme.</p></blockquote><p>Highlights <a href=/highlights/elon_musk>here</a>.</p><p></p>",
      "year": "2023"
    },
    {
      "title": "The Fall of Hyperion",
      "author": "Dan Simmons",
      "dateFinished": "20/09/2023",
      "descriptionHtml": "<p>The second book. Just as good as the first, if not better.</p>",
      "year": "2023"
    },
    {
      "title": "Hyperion",
      "author": "Dan Simmons",
      "dateFinished": "25/08/2023",
      "descriptionHtml": "<p>I was recommended this one (thank you Stuart). The beginning was a bit slow, but by Chapter 2, I was well absorbed. It reminds me of Dune, but more detailed and less moody/introspective. It also reminds me of the <a href=\"https://read.macmillan.com/torforge/texicalaan/\" target=\"_blank\">Texicalaan</a> series in it&#39;s political machinations.</p><p>I loved this book&#39;s use of AI. Even though it was published in 1989, it delivers a convincing and elaborate portrait of what AI could look like 100 years from now. I can&#39;t imagine how much thought was put into this universe.</p><p>I&#39;m looking forward to the second in the series!</p>",
      "year": "2023"
    },
    {
      "title": "Flowers for Algernon",
      "author": "David Keyes",
      "dateFinished": "10/08/2023",
      "descriptionHtml": "<p>What a cool book! Written in the form of journal entries. The crux of it is that the author gets progressively smarter and smarter each day. And all the implications of that. Not that long! </p>",
      "year": "2023"
    },
    {
      "title": "To Sleep in a Sea of Stars",
      "author": "Christopher Paolini",
      "dateFinished": "22/06/2023",
      "descriptionHtml": "<p>Loved this one. An awesome space opera. Kind of Star Warsy, kind of Three-body ish. It contains tropes from countless science-fiction stories but does a good job at carving out original content. Especially concerning the Xeno.</p><p>It is long. 800 pages or something. But it kept me pretty well entertained, especially during the later half. Highlights <a href=/highlights/sea_of_stars>here</a>.</p>",
      "year": "2023"
    },
    {
      "title": "Open",
      "author": "Andre Agassi",
      "dateFinished": "22/06/2023",
      "descriptionHtml": "<p>This is a cool one. An auto-biography/memoir of a very famous tennis player. He was, at several points in his life, the best tennis player in the world. The book goes into his upbringing, his struggles with relationships, his hatred of tennis, etc. A pretty quick read. I&#39;m definitely more into tennis than I was before.</p>",
      "year": "2023"
    },
    {
      "title": "Demon Copperhead",
      "author": "Barbara Kingsolver",
      "dateFinished": "30/05/2023",
      "descriptionHtml": "<p>I <i>really</i> enjoyed this one. The story is set in Alabama around the early 2000s (?). Follows Damon (Demon) throughout his childhood into his adult years. Opioids are a prevalent theme throughout.</p><p>Our protagonist is born into unfortunate circumstances; drug addiction, poverty, foster homes. Fortunately, his facetious inner dialogue is clever enough to keep you more entertained than sad.</p><p>This book gave me invaluable insight into the <i>entire</i> <i>process</i> of opioid addiction, not just adverse effects.</p><blockquote><p>If you’ve not known the dragon we were chasing, words may not help. People talk of getting high, this blast you get, not so much what you feel as what you don’t: the sadness and dread in your gut, all the people that have judged you useless.</p></blockquote><p>Apparently, the book was inspired by <a href=\"https://www.wikiwand.com/en/David_Copperfield\" target=\"_blank\"><i>David Copperfield</i></a>. Back then, <i>Copperfield</i>  served as a critique of society and gave light to Dickens&#39; own experiences in the impoverished underbelly of Victorian England. This book is an effort to do the same in the contemporary American South.</p><p>And despite the context and content, it has a happy ending :)</p><blockquote><p><i>Demon Copperhead</i> speaks for a new generation of lost boys, and all those born into beautiful, cursed places they can&#39;t imagine leaving behind.</p></blockquote><p>All highlights <a href=/highlights/demon_copperhead>here</a>.</p><p></p>",
      "year": "2023"
    },
    {
      "title": "American Prometheus",
      "author": "Kai Bird, Martin J. Sherwin",
      "dateFinished": "07/05/2023",
      "descriptionHtml": "<p><i>American Prometheus</i> is the definitive biography of J. Robert Oppenheimer. You know, the <b>father of the atomic bomb</b>.</p><p>Before his involvement in the Manhattan project and the subsequent devastation that followed, Oppenheimer was quite a talented young physicist. And before that, he was a really smart kid! It&#39;s quite interesting to follow his life and see how all of it lead to one monumental achievement.</p><p>What&#39;s most fascinating to me about this story is the pivotal role of the US military. The scientists were important, but their collaboration with the military was what actually made things happen. And that collaboration was mostly achieved through Oppenheimer.</p><p>The theme of <i>science + military = innovation</i> has appeared before. DARPA basically invented the internet. The GPS, jet engine and radar all originate from a military context. Nuclear weapons are just one item on quite a long list.</p><blockquote><p>“We took this tree with a lot of ripe fruit on it,” Oppenheimer told a Senate committee in late 1945, “and shook it hard and out came radar and atomic bombs.</p></blockquote><p>Unfortunately, when technologies are developed in a military context, it&#39;s difficult to regulate their use in any way. This whole process was difficult to witness in the book. There were many other paths that could&#39;ve been taken which didn&#39;t involve the stockpiling of nuclear weapons or the subsequent cold war. But that&#39;s where we ended up.</p><p>Another notable point is how intrusive the FBI is! Half the reason this book is so detailed is because Oppenheimer was <i>constantly</i> under surveillance. Phones tapped, car tailed, letters opened. Every method you can think of, J. Edgar Hoover made use of. He was insane.</p><p>Anyways, great book. Sometimes tedious, but mostly just interesting. The second half especially (when things blow up). Highlights <a href=/highlights/american_prometheus>here</a>.</p><blockquote><p>“We knew the world would not be the same. A few people laughed, a few people cried. Most people were silent. I remembered the line from the Hindu scripture, the Bhagavad-Gita; Vishnu is trying to persuade the prince that he should do his duty, and to impress him, takes on his multi-armed form and says, ‘Now I am become death, the destroyer of worlds.’ I suppose we all thought that, one way or another.”</p></blockquote><p></p>",
      "year": "2023"
    },
    {
      "title": "Cat's Cradle",
      "author": "Kurt Vonnegut",
      "dateFinished": "20/03/2023",
      "descriptionHtml": "<p>This book follows a reporter who is attempting to write about the man who created the atom bomb. In this universe, someone named Felix Hoenikker. This pursuit eventually brings him to an destitute island called San Lorenzo and chaos ensues. </p><p>There are frequent allusions to the arms race and organized religion throughout. I understand these not-so-subliminal messages were a large reason why Vonnegut wrote the book in the first place. <i>The Books of Bokonon</i> and Bokononism are heavily referenced too. I personally enjoy most of the Bokononist teachings!</p><blockquote><p>As Bokonon says: “Peculiar travel suggestions are dancing lessons from God.”</p></blockquote><blockquote><p>Busy, busy, busy, is what we Bokononists whisper whenever we think of how complicated and unpredictable the machinery of life really is.</p></blockquote><p>A playful, absurd book. I enjoyed it! Highlights <a href=/highlights/cats_cradle>here</a>.</p>",
      "year": "2023"
    },
    {
      "title": "Daisy Jones & The Six",
      "author": "Taylor Jenkins Reid",
      "dateFinished": "08/03/2023",
      "descriptionHtml": "<p>I read this one in about two days. It went by quick! I discovered it because of the relentless promotional campaign surrounding the <a href=\"https://www.imdb.com/title/tt8749198/\" target=\"_blank\">TV show</a>.</p><p>It’s a book that’s easy to read because it conforms perfectly to all the tropes you’d expect from a band’s origin story. Which makes sense because it&#39;s fiction. It’s structured as several interviews with each of the band members, producers, etc. And the interviews are used chronologically to describe situations like the origins of the band, their first show, their time in the studio, their respective relationships, etc.</p><p>After examining the history, there is not much overlap between Fleetwood Mac’s history and Daisy Jones &amp; The Six. And there shouldn’t need to be! The author never claims that! </p><p>I just found myself thinking, why don’t I just read a history of Fleetwood Mac? I’d like to relate the episodes in this band’s history to <i>real</i> songs they produced, not some fictional band’s music. Oh well, next time.</p><p></p>",
      "year": "2023"
    },
    {
      "title": "Barbarian Days: A Surfing Life",
      "author": "William Finnegan",
      "dateFinished": "26/02/2023",
      "descriptionHtml": "<p>Before I surfing in Costa Rica I wanted to read a practical guide on <i>how</i> to surf. Some kind of instruction manual. But it didn’t seem like there was any clear option.</p><p>I stumbled on this book that ranked at the top of every “surfer book” list. It’s less about the mechanics of surfing and more a memoir of a guy who loves to surf.</p><p>It felt reminiscent of Jack Kerouac’s <i>On the Road</i>. One of those stories that follows someone’s <i>journey</i>. Both physical and spiritual. </p><p>But there’s more breadth to <i>Barbarian Days</i> than <i>On the Road</i>. Instead of remaining in the continental United States, the author travels to Hawaii, Indonesia, Fiji, South Africa, Australia, Portugal and finally settles in New York City. He surfs in every place.</p><p>I really enjoyed it. It&#39;s a wonderful memoir and a life to be proud of.</p><blockquote><p>Caryn liked to say, quoting Walpole, that life is a comedy to those who think, a tragedy to those who feel.</p></blockquote><p></p>",
      "year": "2023"
    },
    {
      "title": "The Netanyahus",
      "author": "Joshua Cohen",
      "dateFinished": "21/02/2023",
      "descriptionHtml": "<p>This one is dense. It was hard to start because it felt overly intricate and uses a lot of complex language. And there is no clear direction to the story at first.</p><p>Tells the story of Harold Blum’s encounter with the Netanyahu family in the 1960s. The Netanyahu’s are most notably the family of <a href=\"https://www.wikiwand.com/en/Benjamin_Netanyahu\" target=\"_blank\">Benjamin Netanyahu</a> who is the current(?) president of Israel.</p><p>Interestingly, it’s not a particularly engaging narrative. That’s what made it difficult to start. Most of it revolves around exposition surrounding the professor’s job and a pseudo-history of the Jewish people and state in the context of the various academia. It gets pretty in the weeds.</p><p>It&#39;s only in the second half of this book (after the Netanyahus are introduced) that the narrative picks up and gains a clear direction.</p><p>The Netanyahus are characterized in the book as being a pushy, mean and aggressive family. It gets comedic because they are so ignorant of social graces.</p><p>I only realized after reading the acknowledgements that this book is basically a criticism of current right-wing Israeli politics disguised as narrative fiction. A political think-piece dressed as a mundane episode in this family’s life. </p><p>Not that I disagree with any of the political points the author is making! It&#39;s just an interesting medium to express them.</p><blockquote><p>His reign, marked by the building of walls, the construction of settlements, and the normalization of occupation and state violence against the Palestinians, represents the ultimate triumph of the formerly disgraced Revisionist vision promulgated by his father.</p></blockquote><p></p>",
      "year": "2023"
    },
    {
      "title": "Manhattan Beach",
      "author": "Jennifer Egan",
      "dateFinished": "16/01/2023",
      "descriptionHtml": "<p>This one is set in New York (Brooklyn) during the second World War. Tells the story of Anna Kerrigan and her family. It also follow Dexter Styles, a nightclub owner/mobster who deals with Anna&#39;s father. <i>Soooo</i> much more linear than <a href=\"https://kahvipatel.com/book-shelf#a-visit-from-the-goon-squad\" >Goon Squad</a> or <a href=\"https://kahvipatel.com/book-shelf#candy-house\" >Candy House</a>.</p><p>The first part of this book follows Anna in childhood. The second part follows her as she becomes a professional diver for the army. Both parts give an incredible impression of what it must&#39;ve been like to live during that time. The whole Brooklyn/Naval Yard setting is quite vivid. It&#39;s clear that everything was meticulously researched.</p><p>The latter third of the book talks a lot about sailing. Which I like. </p><blockquote><p>“Iron men in wooden boats,” they were called...Old salts partook of an origin myth, being close to the root of all things, including language. Eddie had never noticed how much of his own speech derived from the sea, from “keeled over” to “learning the ropes” to “catching the drift” to “freeloader” to “gripe” to “brace up” to “taken aback” to “leeway” to “low profile” to “the bitter end,” or the very last link on a chain. Using these expressions in a practical way made him feel close to something fundamental—a deeper truth whose contours he believed he’d sensed, allegorically, even while still on land. Being at sea had brought Eddie nearer that truth. And the old salts were nearer still.</p></blockquote><p>Out of the three books I&#39;ve read, I found this one to be the quickest. Probably because it has &quot;the <a href=\"https://www.goodreads.com/book/show/34467031-manhattan-beach\" target=\"_blank\">atmosphere</a> of a noir thriller&quot;.</p><p>Highlights <a href=/highlights/manhattan_beach>here</a>.</p>",
      "year": "2023"
    },
    {
      "title": "The Little Prince",
      "author": "Antoine de Saint-Exupéry",
      "dateFinished": "04/01/2023",
      "descriptionHtml": "<p>I thought this book was sweet and emotional and a bit lonely. But full of heartwarming moments and poetry.</p><blockquote><p>It is only with the heart that one can see rightly; </p><p>what is essential is invisible to the eye.</p></blockquote><p></p>",
      "year": "2023"
    },
    {
      "title": "Candy House",
      "author": "Jennifer Egan",
      "dateFinished": "03/01/2023",
      "descriptionHtml": "<p>I loved this book. It overlaps with <a href=\"https://kahvipatel.com/book-shelf#a-visit-from-the-goon-squad\" >A Visit from the Goon Squad</a>. Same universe and a few of the same characters.</p><p>This one is also intelligent and quite funny. And emotional in subtle ways. I also like the new technology they introduce (it&#39;s not cheesy).</p><p>I’m currently reading <a href=\"https://www.goodreads.com/book/show/34467031-manhattan-beach\" target=\"_blank\">Manhattan Beach</a> which Jennifer Egan wrote between Goon Squad and Candy House. It’s sort of a noir thriller and very good.</p><p>Highlights <a href=/highlights/candy_house>here</a>.</p>",
      "year": "2023"
    },
    {
      "title": "How to Not Die Alone",
      "author": "Logan Ury",
      "dateFinished": "26/12/2022",
      "descriptionHtml": "<p>A book about dating, relationships and break-ups. Probably the first self-help book I&#39;ve read about relationships. Authored by an ex-Googler! Terrible title.</p><p>I learned about a few things from this book:</p><ul><li><p><a href=\"https://www.wikiwand.com/en/Attachment_theory#Attachment_patterns\" target=\"_blank\">Attachment Styles</a></p></li><li><p>Learning to <a href=\"https://lifehacker.com/be-a-better-conversationalist-by-supporting-instead-of-1835373108\" target=\"_blank\">support rather than shift</a></p></li><li><p><a href=\"https://www.wisebrain.org/papers/ChoosingHappiness.pdf\" target=\"_blank\">Maximizing vs Satisficing</a> (<a href=\"https://www.wikiwand.com/en/Satisficing\" target=\"_blank\">satisficing</a>)</p></li><li><p><a href=\"https://www.wikiwand.com/en/Optimal_stopping\" target=\"_blank\">Optimal stopping</a> in the context of <a href=\"https://www.washingtonpost.com/news/wonk/wp/2016/02/16/when-to-stop-dating-and-settle-down-according-to-math/\" target=\"_blank\">dating</a> </p></li></ul><p>All four of those things have changed the way I think about relationships. Hopefully for the better!</p><p>Here’s a few quotes:</p><blockquote><p>Here’s the key: It’s fine to have different interests, so long as the time you spend pursuing your favourite activities doesn’t preclude you from investing in the relationship.</p></blockquote><blockquote><p>“When choosing a long-term partner, you will inevitably be choosing a particular set of unresolvable problems.”</p></blockquote><blockquote><p>Decide, don’t slide.</p></blockquote><p>Some more quotes <a href=/highlights/how_to_not_die_alone>here</a>.</p>",
      "year": "2022"
    },
    {
      "title": "The Premonition: A Pandemic Story",
      "author": "Michael Lewis",
      "dateFinished": "20/12/2022",
      "descriptionHtml": "<p>A book about the recent history of pandemic handling in the U.S and a perspective on what happened behind the scenes during the COVID-19 pandemic.</p><p>I got through this book in no time. Michael Lewis has tremendous skill at making nonfiction interesting. He transformed what should be a pedantic story into a surprisingly riveting narrative.</p><p>The most interesting character in this story is Carter Mecher. He&#39;s the perfect underdog; the antithesis to an individualistic American ideology. Someone to make up for the failures at various levels of government. The email thread they mention throughout the book is linked <a href=\"https://int.nyt.com/data/documenthelper/6879-2020-covid-19-red-dawn-rising/66f590d5cd41e11bea0f/optimized/full.pdf\" target=\"_blank\">here</a> and <a href=\"https://www.nytimes.com/2020/04/11/us/politics/coronavirus-red-dawn-emails-trump.html\" target=\"_blank\">here</a>. Also cool: Most of the people in this book are now part of <a href=\"https://www.phc.health/team\" target=\"_blank\">The Public Health Company</a> (private industry wins once again 😞).</p><p>Another standout from this book was Lewis&#39; criticism of the CDC. Mostly their lack of responsiveness;</p><blockquote><p>It shouldn’t be the Centers for Disease Control. It should be the Centers for Disease Observation and Reporting. That’s what they do well.</p></blockquote><p>My perception of the CDC was definitely changed by this book.</p><p>Overall, a comfortable and not overly depressing entry into literature surrounding the COVID-19 pandemic. Highlights coming soon.</p><p></p>",
      "year": "2022"
    },
    {
      "title": "A Desolation Called Peace",
      "author": "Arkady Martine",
      "dateFinished": "05/12/2022",
      "descriptionHtml": "<p>My first science-fiction in a while and I <i>really</i> enjoyed it. It&#39;s the second book of the Teixcalaan series, after <i>A Memory Called Empire</i>.</p><p>I loved the first book because it was intricate and political. It reminded me of Dune except less prophetic/religious and more poetic/practical. </p><p>Arkady Martine&#39;s ability to world-build the Teixcalaan culture is incredible (she&#39;s also a historian and city planner). Her <a href=\"https://www.npr.org/2019/04/07/710356506/questions-for-arkady-martine-author-of-a-memory-called-empire\" target=\"_blank\">interview with NPR</a> goes into it:</p><blockquote><p>I wanted to think about empires that were conquest-oriented, that were war-and-sacrifice oriented, and that led me to the Mexica — the Triple Alliance of the Aztecs.</p></blockquote><blockquote><p>there&#39;s a lot of American cultural imperialism in how Teixcalaan spreads itself across the galaxy. It&#39;s not <i>just</i> a military power — it&#39;s a pervasive cultural one. Unavoidable, like McDonald&#39;s and Hollywood movies.</p></blockquote><p>And regarding poetry within the Empire:</p><blockquote><p>A great deal of the plot of <i>A Memory Called Empire</i> moves through the speaking of, transmission of, and use/reuse of poetic form: there&#39;s a poetry contest that prefigures a war, for example, and a protest song which first incites a riot and then is used to calm it down.</p></blockquote><p>In addition to these things, the crux of the second book is one of my favourite topics; alien first contact. Specifically, a whole galactic empire encountering a threatening new species.</p><p>This book does a terrific job with the aliens. In fact, it’s one of my favourite stories about alien life I’ve encountered so far. I especially liked Swarm&#39;s &quot;internal&quot; dialogue in the later parts of the book. </p><p>This is a good one! Goes right along with my favourite first-contact stories like <i>Arrival</i> and <i>Three Body Problem.</i></p>",
      "year": "2022"
    },
    {
      "title": "Kitchen Confidential",
      "author": "Anthony Bourdain",
      "dateFinished": "05/11/2022",
      "descriptionHtml": "<p>I&#39;ve known about Anthony Bourdain for a while, but this was my first time reading anything of his.</p><p>His writing is straightforward and cutting. Sort of like his clips on YouTube. Often hyperbolic, sometimes rude, but charming. This book describes his journey into cooking and his philosophy on food, restaurants and several more things.</p><blockquote><p>Vegetarians, and their Hezbollah-like splinter-faction, the vegans, are a persistent irritant to any chef worth a damn. To me, life without veal stock, pork fat, sausage, organ meat, demi-glace, or even stinky cheese is a life not worth living. Vegetarians are the enemy of everything good and decent in the human spirit, an affront to all I stand for, the pure enjoyment of food.</p></blockquote><p>Having worked in the service industry for all of 4 months, I could empathize with some of the things he describes. Although most of it was crazy:</p><blockquote><p>If you cut yourself in the Work Progress kitchen, tradition called for maximum spillage and dispersion of blood. One squeezed the wound till it ran freely, then hurled great gouts of red spray on the jackets and aprons of comrades.</p></blockquote><p>I enjoyed this one. Bourdain isn&#39;t afraid of making fun of himself or going to great lengths to describe his drug usage. It left me contemplating how a chef and their crew is the last remnant of a crazier time. At least back in the 90s.</p><p>Highlights <a href=/highlights/kitchen_confidential>here</a>.</p>",
      "year": "2022"
    },
    {
      "title": "On the Road",
      "author": "Jack Kerouac",
      "dateFinished": "10/10/2022",
      "descriptionHtml": "<p>This one took me a while. It feels like I&#39;ve been trying to explain what it&#39;s about to other people more than I&#39;ve been reading it.</p><p>Vaguely reminiscent of Grapes of Wrath and travelling across America. Set a bit later on though, in the 50s instead of the 30s.</p><p>This story basically consists of the narrator/Sal/Kerouac doing something boring until Dean/Neal Cassady comes along and leads them across America to do crazy things.</p><blockquote><p>It never occurs to you that life is serious and there are people trying to make something decent out of it instead of just goofing all the time.” That’s what Dean was, the HOLY GOOF.</p></blockquote><p>Dean/<a href=\"https://en.wikipedia.org/wiki/Neal_Cassady\" target=\"_blank\">Neal Cassady</a> is the most interesting character by a longshot. Marrying three women, fathering five children, going to prison, stealing cars, doing drugs, driving at ludicrous speeds. Always chaotic. Often misogynistic and narcissistic. Kerouac clearly admires Cassady&#39;s intelligence and the scale of his magnetism. Perhaps he is the very personification of a hedonistic lifestyle.</p><blockquote><p>But when she watched him like this it was love too; and when Dean noticed he always turned with his big false flirtatious smile, with the eyelashes fluttering and the teeth pearly white, while a moment ago he was only dreaming in his eternity.</p></blockquote><p>I need to read more about the <a href=\"https://www.wikiwand.com/en/Beat_Generation\" target=\"_blank\">Beat Generation</a> after this book.</p>",
      "year": "2022"
    },
    {
      "title": "The Firm",
      "author": "John Grisham",
      "dateFinished": "24/08/2022",
      "descriptionHtml": "<p>Awesome legal thriller. Barely about legal stuff though, mostly thriller. I&#39;m into it; it&#39;s complex enough not to be boring. Kept picturing the main guy as Tom Cruise since that who plays him in the movie. I should watch that at some point.</p>",
      "year": "2022"
    },
    {
      "title": "The Elegance of the Hedgehog",
      "author": "Muriel Barbery",
      "dateFinished": "14/07/2022",
      "descriptionHtml": "<p>This book follows two characters who live in Paris in an upscale apartment building. One is a concierge (Renée) and one is the daughter of one of the tenants (Paloma).</p><p>The story reminds me of <i>A Gentleman in Moscow</i>. Both take place mostly in one building and consist of mostly internal dialogue by the protagonist(s).</p><p>There are several philosophical asides throughout this book. Some I found slightly pretentious and tiring, but most were illuminating (the <a href=\"https://en.wikipedia.org/wiki/Anna_Karenina_principle\" target=\"_blank\">Anna Karenina principle</a>). And despite these frequent asides, the narrative keeps you interested. </p><p>It&#39;s an emotional story. Even though Renée and Paloma are both quite reserved, their inner dialogues are full of joy, sadness, loneliness, anger. It makes for an entertaining narrative.</p><blockquote><p>This is a moving, funny, triumphant novel that exalts the quiet victories of the inconspicuous among us. </p></blockquote><p>- <a href=\"https://www.goodreads.com/book/show/2967752-the-elegance-of-the-hedgehog\" target=\"_blank\">Goodreads</a></p><blockquote><p>Madame Michel has the elegance of the hedgehog: on the outside, she’s covered in quills, a real fortress, but my gut feeling is that on the inside, she has the same simple refinement as the hedgehog: a deceptively indolent little creature, fiercely solitary—and terribly elegant.</p></blockquote><p>Highlights <a href=/highlights/the_elegance_of_the_hedgehog>here</a>.</p><p></p>",
      "year": "2022"
    },
    {
      "title": "Percy Jackson (Books 3-5)",
      "author": "Rick Riordan",
      "dateFinished": "30/06/2022",
      "descriptionHtml": "<p>The Titan&#39;s Curse, The Battle of the Labyrinth, The Last Olympian. All entertaining. Especially the last one. Once in a while, the narrative will hit some interesting moral dilemma. Might move on to the <i>Heroes of Olympus</i> series next.</p><blockquote><p>Hermes’ shoulders sagged. ‘They’ll try, Percy. Oh, we’ll all try to keep our promise. And maybe for a while things will get better. But we gods have never been good at keeping oaths. You were born because of a broken promise, eh? Eventually we’ll become forgetful. We always do.’ </p><p>‘You can change.’ </p><p>Hermes laughed. ‘After three thousand years, you think the gods can change their nature?’</p><p>‘Yeah,’ I said. ‘I do.’</p></blockquote><p></p>",
      "year": "2022"
    },
    {
      "title": "The Emperor of All Maladies",
      "author": "Siddhartha Mukherjee",
      "dateFinished": "08/06/2022",
      "descriptionHtml": "<p>I think this is the first non-fiction book I&#39;ve finished in 2022. It recounts the history of cancer from the early 19th century (ish) until now.</p><p>This is a humbling book. Cancer is a disease intrinsic to the human genome, yet there is no absolute cure. And even no clear path for <i>finding</i> a cure.</p><blockquote><p>It [cancer treatment] is almost—not quite, but almost—as hard as finding some agent that will dissolve away the left ear, say, and leave the right ear unharmed. So slight is the difference between the cancer cell and its normal ancestor. </p></blockquote><p>I haven&#39;t read all that much about other human diseases, but cancer seems to occupy a unique place in our common consciousness. It breeds a different kind of pessimism.</p><p>It was tough getting through the first part of this book. The brutality of early breast cancer treatment is terrifying. The prevailing medical theory was to remove as much flesh and bone surrounding the tumour as possible. For years, the correlation between amount of tissue removed and longer remission of cancer seemed viable. Until a study concluded it made <b>no difference</b>. Depressing.</p><blockquote><p>Cancer therapy is like beating the dog with a stick to get rid of his fleas.</p></blockquote><p>This is not to say there&#39;s been no progress made. Outcomes for many strains of cancer continue to improve. Less people die of cancer than <i>ever before</i>. And Mukherjee makes a point to applaud these improvements.</p><p>It&#39;s just such a complicated disease. And often the research described in the book seems disconnected from a cure. We take steps to understand the cause of cancer, but it&#39;s tough for those discoveries to ever leave the lab.</p><p>Towards the end, Mukherjee dives deeper into the genetic nature of cancer. It seems like he is biased towards that path eventually revealing some ultimate cure we&#39;re seeking. The logical &quot;sequel&quot; to this book is his <i>The Gene: An Intimate History</i>.</p><p>I think it&#39;s valuable to learn about the history of humans and cancer. This disease has plagued us for as long as we&#39;ve been smart enough to write about it. It feels like a ceiling that the human race will perpetually be hitting. Or we might break through. Who knows.</p><blockquote><p>Cancer thus exploits the fundamental logic of evolution unlike any other illness. If we, as a species, are the ultimate product of Darwinian selection, then so, too, is this incredible disease that lurks inside us.</p></blockquote><blockquote><p>\r</p></blockquote><blockquote><p>\r\r\r\r</p></blockquote><blockquote><p>\r</p></blockquote><blockquote><p>Indeed, cancer’s emergence in the world is the product of a double negative: it becomes common only when all other killers themselves have been killed.</p></blockquote><p>Highlights <a href=/highlights/the_emperor_of_all_maladies>here</a>.\r\n\r</p>",
      "year": "2022"
    },
    {
      "title": "Percy Jackson: The Sea of Monsters",
      "author": "Rick Riordan",
      "dateFinished": "30/04/2022",
      "descriptionHtml": "<p>A fun sequel to The Lightning Thief. Percy and friends explore the Bermuda Triangle and encounter several Greek mythological figures on the way. Rick Riordan does a great job at keeping the main villain relevant, but never fully in view. It&#39;s reminiscent of Thanos in the first few Marvel movies. </p><p>I&#39;m trying to figure out what makes these books so easy to read. I don&#39;t consider Percy an exceptionally likeable protagonist. He doesn&#39;t mature emotionally all that much. Maybe it&#39;s just the narrative surrounding him? 🤷‍♂️</p>",
      "year": "2022"
    },
    {
      "title": "Project Hail Mary",
      "author": "Andy Weir",
      "dateFinished": "17/04/2022",
      "descriptionHtml": "<p>Very sciencey science fiction. It reminds me a lot of <i>The Martian</i>. At some points it reads like a science textbook, like it&#39;s trying to teach you about some physics problem for a test. Or maybe that&#39;s just me.</p><p><i>Spoilers Ahead</i></p><p>The book is centered around the protagonists&#39; friendship with an alien. In fact, the book completely relies on the fact that they can communicate and are <i>friendly </i>towards each other. I have trouble dealing with both these assumptions, but I can appreciate the need for them.</p><p>The more significant assumption, in my opinion, is our main character&#39;s ability to solve almost <i>any</i> scientific problem that&#39;s thrown at him. In <i>The Martian</i>, Matt Damon was a trained biologist/astronaut and he ended up doing biology in space. Understandable. </p><p>In <i>Project Hail Mary</i>, Ryland Grace is a highschool science teacher who used to be a microbiologist, and he ends up doing <i>literally everything</i>. From explaining the theory of relativity, to breeding organisms, to coding a pretty comprehensive computer app. Maybe I&#39;m just a cynic, but that stretched the limits of my belief.</p><p>Still though, it made for an interesting read. It&#39;s a fun story. No more sciencey books for a while.</p>",
      "year": "2022"
    },
    {
      "title": "Percy Jackson: The Lightning Thief",
      "author": "Rick Riordan",
      "dateFinished": "20/03/2022",
      "descriptionHtml": "<p>Read this book in one day. Needed something to keep me occupied for the trip back to Victoria.</p><p>Gives me the same feeling that I remember when I first read it. It&#39;s exciting and fast and angsty. Plays out like an action movie (at least in my head). </p><p>Will I be reading the whole series? Who knows (probably).</p><p></p>",
      "year": "2022"
    },
    {
      "title": "East of Eden",
      "author": "John Steinbeck",
      "dateFinished": "17/03/2022",
      "descriptionHtml": "<p>It&#39;s been a while since I&#39;ve finished a book. I&#39;ve started several, but they&#39;re either too long or I get bored.</p><p>Like Grapes of Wrath, it&#39;s also a family saga. We follow the Trask family (mostly Adam) and the Hamilton family over the course of several decades. Set in Salinas Valley, California in the early 1900s.</p><p>I finished this book because of Steinbeck&#39;s writing style. I enjoy his conciseness. It&#39;s not particularly romantic, or funny, or witty. But it&#39;s straightforward and timeless. I was rarely distracted by historical references that I didn&#39;t understand. </p><p>I can&#39;t pretend I understood all the intricacies of this story.  Especially who the narrator was (Hamilton = Steinbeck?). And how it compares to the Book of Genesis.</p><p>But I&#39;m content to enjoy this book for what it offers at first glance; an intricate and exciting narrative. My highlights are <a href=/highlights/east_of_eden>here</a>.</p><blockquote><p>And it never failed that during the dry years the people forgot about the rich years, and during the wet years they lost all memo­ry of the dry years. It was always that way.</p></blockquote><p></p>",
      "year": "2022"
    },
    {
      "title": "The Dark Tower VII: The Dark Tower",
      "author": "Stephen King",
      "dateFinished": "03/01/2022",
      "descriptionHtml": "<p>The story was well constructed and exciting. The first ending was nice. The second ending was less nice, but honest. I admire Roland immensly. I want to be more like him. Nothing else to say on my end, except some quotes.</p><blockquote><p>He slipped the .40 into his docker’s clutch almost without thinking, so moving us a step closer to what you will not want to hear and I will not want to tell.</p></blockquote><p>Stephen King writes in 1, 2nd and 3rd person at the same time.</p><blockquote><p>Susannah looked at Eddie with her eyebrows raised. Eddie gave her a tell-you-later look in return. It was a simple and perfect bit of wordless communication, the sort people who love each other take for granted.</p></blockquote><p>He&#39;s romantic.</p><blockquote><p>He used to tell me that never’s the word God listens for when he needs a laugh.</p></blockquote><p>Sometimes you gotta read it over twice.</p><blockquote><p>And will I tell you that these three lived happily ever after? I will not, for no one ever does. But there was happiness. And they did live. Beneath the flowing and sometimes glimpsed glammer of the Beam that connects Shardik the Bear and Maturin the Turtle by way of the Dark Tower, they did live. That’s all. That’s enough. Say thankya.</p></blockquote><p>But he wraps it up nicely.</p><p></p>",
      "year": "2022"
    },
    {
      "title": "The Dark Tower VI: Song of Susannah",
      "author": "Stephen King",
      "dateFinished": "15/12/2021",
      "descriptionHtml": "<p>It&#39;s been a while since I&#39;ve finished a book. Work has been taking up a lot of my time and attention. I&#39;ve started a few books, but keep losing track around halfway through. Good to return to an old faithful.</p><p>This one focuses more on one character in the ka-tet; Susannah. It plays a bit more with breaking the fourth wall. In fact, Stephen King is a character in the book who speaks about writing the first volume of this series. Very meta.</p><p>Anyways, I&#39;m excited to finish this series. It will force me to move onto some non-fiction.</p>",
      "year": "2021"
    },
    {
      "title": "The Dark Tower V: Wolves of the Calla",
      "author": "Stephen King",
      "dateFinished": "14/10/2021",
      "descriptionHtml": "<p>This one felt long, but I don&#39;t have a way to tell how long it was since I read everything on the Kindle. We meet a new member of the <a href=\"https://stephenking.fandom.com/wiki/Ka-tet\" target=\"_blank\">Ka-tet</a>. I enjoyed it! Some intense gunslinging at the end.</p><blockquote><p>“Hile!” the last dozen cry beneath that blazing sun. It is the end of them, the end of Gilead, the end of everything, and he no longer cares. The old red fury, dry and maddening, is settling over his mind, drowning all thought. One last time, then, he thinks. Let it be so.</p></blockquote><p></p>",
      "year": "2021"
    },
    {
      "title": "The Dark Tower: The Wind Through the Keyhole",
      "author": "Stephen King",
      "dateFinished": "06/09/2021",
      "descriptionHtml": "<p>This book is technically the eighth in the series, but is set between the fourth and fifth books chronologically. It&#39;s mostly self-contained, except some developing of Roland and his mother&#39;s relationship. I enjoyed the <i>Wind Through the Keyhole</i> story that younger Roland tells. Now onto the fifth.</p>",
      "year": "2021"
    },
    {
      "title": "The Dark Tower IV: Wizard and Glass",
      "author": "Stephen King",
      "dateFinished": "02/09/2021",
      "descriptionHtml": "<p>This book explores Roland&#39;s past. It mostly consists of a self-contained story that Roland tells to the rest of the group. It&#39;s my favourite of the series so far, mostly because of the love story at the center of Roland&#39;s recounted story. I&#39;m a sucker for romance. Onto the fifth.</p>",
      "year": "2021"
    },
    {
      "title": "The Autobiography of Malcolm X ",
      "author": " Malcolm X, Alex Haley",
      "dateFinished": "23/08/2021",
      "descriptionHtml": "<p>I became aware of this book after hearing Casey Neistat <a href=\"https://tim.blog/wp-content/uploads/2018/08/116-casey-neistat.pdf\" target=\"_blank\">recommend it</a>. Before this, I only had a blurry idea of Malcolm X and his place in the civil rights movement. </p><p>The central part of this book revolves around Malcolm&#39;s time in the <a href=\"https://www.wikiwand.com/en/Nation_of_Islam\" target=\"_blank\">Nation of Islam</a> church. Although he broke with them later to become a Sunni Muslim, this is where he developed a international reputation and evolved into one of the greatest communicators of that era. Looking back on what he was preaching in today&#39;s context is difficult. It&#39;s pretty divisive stuff.</p><blockquote><p>And we see again that not ideologies, but race, and color, is what binds human beings.</p></blockquote><blockquote><p>For the white man to ask the black man if he hates him is just like the rapist asking the raped, or the wolf asking the sheep, ‘Do you hate  me?’ The white man is in no moral position to accuse anyone else of hate!</p></blockquote><p>But what I find most impressive about Malcolm is his evolution. It&#39;s an extraordinary character arc. His life before prison was full of crime, drugs, guns, robbery. His life after prison was disciplined, sober, productive. His preaching for the <a href=\"https://www.wikiwand.com/en/Nation_of_Islam\" target=\"_blank\">Nation of Islam</a> were fundamentally divisive, racist and incendiary. His beliefs after his break with the church and pilgrimage to Mecca were more tolerant, liberal and optimistic.</p><blockquote><p>In the past, yes, I have made sweeping indictments of all white people. I never will be guilty of that again—as I know now that some white people are truly sincere, that some truly are capable of being brotherly toward a black man. The true Islam has shown me that a blanket indictment of all white people is as wrong as when whites make blanket indictments against blacks.</p></blockquote><p>An impressive man and one of the most talented speakers ever. My highlights are <a href=/highlights/malcolm_x>here</a>.</p><p></p><p></p>",
      "year": "2021"
    },
    {
      "title": "The Dark Tower III: The Waste Lands ",
      "author": "Stephen King",
      "dateFinished": "01/08/2021",
      "descriptionHtml": "<p>Roland and his fellow gunslingers continue their quest towards the Dark Tower. This one explores a more modern setting. Jake (from Dark Tower I) joins the crew again. More explorations of Roland&#39;s philosophy and background. Onto book four.</p><blockquote><p>&quot;What if I told you I don’t want to be a gunslinger, Roland old buddy?&quot;</p><p>&quot;I’d say that what you want doesn’t much matter.” Roland was looking at the metal kiosk which stood against the rock wall, and seemed to have lost interest in the conversation. Eddie had seen this before. When the conversation turned to questions of should-be, could-be, or oughtta-be, Roland almost always lost interest.</p></blockquote><p></p><p></p>",
      "year": "2021"
    },
    {
      "title": "The Argonauts",
      "author": "Maggie Nelson",
      "dateFinished": "26/07/2021",
      "descriptionHtml": "<p>An intellectual exploration of sex, pregnancy, childbirth and gender. Also a memoir. This book is written so gracefully. It&#39;s not long and every sentence is valuable. I was taken with the second half of the book, when Nelson starts to focus more on family and child birth. </p><blockquote><p>As my body made the male body, I felt the difference between male and female body melt even further away. I was making a body with a difference, but a girl body would have been a different body too.</p></blockquote><blockquote><p>I want you to know, you were thought of as possible—never as certain, but always as possible—not in any single moment, but over many months, even years, of trying, of waiting, of calling—when, in a love sometimes sure of itself, sometimes shaken by bewilderment and change, but always committed to the charge of ever-deepening understanding—two human animals, one of whom is blessedly neither male nor female, the other of whom is female (more or less), deeply, doggedly, wildly wanted you to be.</p></blockquote><p>It&#39;s a book that I think is worth reading twice. So many references to literature. And an accurate but subtle description of the transgender condition.</p><blockquote><p>How to explain, in a culture frantic for resolution, that sometimes the shit stays messy? I do not want the female gender that has been assigned to me at birth. Neither do I want the male gender that transsexual medicine can furnish and that the state will award me if I behave in the right way. I don’t want any of it. How to explain that for some, or for some at some times, this irresolution is OK—desirable, even (e.g., “gender hackers”)—whereas for others, or for others at some times, it stays a source of conflict or grief? How does one get across the fact that the best way to find out how people feel about their gender or their sexuality—or anything else, really—is to listen to what they tell you, and to try to treat them accordingly, without shellacking over their version of reality with yours?” </p></blockquote><p></p>",
      "year": "2021"
    },
    {
      "title": "The Grapes of Wrath",
      "author": "John Steinbeck",
      "dateFinished": "26/06/2021",
      "descriptionHtml": "<p>This is a book they make you read in high school. The story of a family in the 1930&#39;s who must leave their farmland in the American Midwest and make their way to California. </p><p>This family is a tirelessly practical unit. Everyone is competent, able and independent. They are also constantly kind and decent. Offering food to those who don&#39;t have any, helping strangers on the side of the road.</p><p>Once they arrive in California, the influx of migrant workers leads to low wages and poor living conditions. And so the family&#39;s morality is set against the harsh work they are forced to do. The imbalance between the worker and employer, man and woman, adult and child. They live on the edge of poverty for the majority of this story. </p><p>Steinbeck based this book off a <a href=\"https://www.wikiwand.com/en/The_Harvest_Gypsies\" target=\"_blank\">series of articles</a> he wrote for the San Francisco News in October of 1936. More than anything, this book contextualized that era of American history. The Great Depression, the Dust Bowl, unions, migrant workers, etc. My highlights are <a href=/highlights/the_grapes_of_wrath>here</a>.</p><blockquote><p>I noticed that. Man, he lives in jerks - baby born an&#39; a man dies, an&#39; that&#39;s a jerk - gets a farm an&#39; loses his farm, an&#39; that&#39;s a jerk. Woman, it&#39;s all one flow, like a stream, little eddies, little waterfalls, but the river, it goes right on. Woman looks at it like that.</p></blockquote><blockquote><p>Carbon is not a man, nor salt nor water nor calcium. He is all these, but he is much more, much more; and the land is so much more than its analysis. The man who is more than his chemistry, walking on the earth, turning his plow point for a stone, dropping his handles to slide over an outcropping, kneeling in the earth to eat his lunch; that man who is more than his elements knows the land that is more than its analysis.</p></blockquote><p></p>",
      "year": "2021"
    },
    {
      "title": "The Dark Tower II: The Drawing of the Three",
      "author": "Stephen King",
      "dateFinished": "07/06/2021",
      "descriptionHtml": "<p>Exciting fantasy. Roland&#39;s quest continues and my infatuation with him grows. Something about his absolute certainty and uncanny gunslinging ability is just so cool. Two characters are introduced in this book and offer a welcome contrast. I&#39;m looking forward to the third book.</p><blockquote><p>“What’s ka?” Eddie’s voice was truculent. “I never heard of it. Except if you say it twice you come out with the baby word for shit.”</p><p>“I don’t know about that,” the gunslinger said. “Here it means duty, or destiny, or, in the vulgate, a place you must go.”</p><p>Eddie managed to look dismayed, disgusted, and amused all at the same time. “Then say it twice, Roland, because words like that sound like shit to this kid.”</p><p>The gunslinger shrugged. “I don’t discuss philosophy. I don’t study history. All I know is what’s past is past, and what’s ahead is ahead. The second is ka, and takes care of itself.”</p></blockquote><blockquote><p>In matters of the Tower, fate became a thing as merciful as the lighter which had saved his life and as painful as the fire the miracle had ignited. Like the wheels of the oncoming train, it followed a course both logical and crushingly brutal, a course against which only steel and sweetness could stand.</p></blockquote><p></p>",
      "year": "2021"
    },
    {
      "title": "Harry Potter (Books 6,7)",
      "author": "J.K. Rowling",
      "dateFinished": "15/05/2021",
      "descriptionHtml": "<p>A more serious tone than the last few; some chapters are seriously bleak. But what a thrilling conclusion. I think it does the series justice. Now I just need to watch all the Fantastic Beast movies because those are canon <a href=\"https://www.quora.com/Is-Fantastic-Beasts-and-Where-to-Find-Them-canon-to-the-Harry-Potter-books-or-movies-universe\" target=\"_blank\">apparently</a>. </p><blockquote><p>“Doctors?” said Ron, looking startled. “Those Muggle nutters that cut people up? Nah, they’re Healers.&quot;</p></blockquote><blockquote><p>...he let out a hoselike jet that ricocheted off the ceiling and knocked Professor Flitwick flat on his face.</p></blockquote><blockquote><p>Indeed, a week after Fred and George’s departure Harry witnessed Professor McGonagall walking right past Peeves, who was determinedly loosening a crystal chandelier, and could have sworn he heard her tell the poltergeist out of the corner of her mouth, “It unscrews the other way.”</p></blockquote><blockquote><p>[Luna] crouched down and placed her fingers tenderly upon each of the elf&#39;s eyelids, sliding them over his glassy stare. &quot;There,&quot; she said softly. &quot;Now he could be sleeping.&quot;</p></blockquote><blockquote><p>As Harry and Ron had become more discouraged, Hermione seemed to have become more determined.</p></blockquote><blockquote><p>“Of course it is happening inside your head, Harry, but why on earth should that mean that it is not real?”</p></blockquote><p></p><p></p><p></p>",
      "year": "2021"
    },
    {
      "title": "Harry Potter (Books 1-5)",
      "author": "J.K Rowling",
      "dateFinished": "14/04/2021",
      "descriptionHtml": "<p>I love this series. The first three books introduce an incredible Wizarding world. Then they turn darker and more enthralling. A book series I can escape to. I love the prominence of British culture throughout. Reading book 6 currently, looking forward to the end! </p>",
      "year": "2021"
    },
    {
      "title": "Sapiens",
      "author": "Yuval Noah Harari",
      "dateFinished": "14/03/2021",
      "descriptionHtml": "<p>Sapiens is a book that makes you zoom out. It mostly describes the Paleolithic emotions part of this quote.</p><blockquote><p>The real problem of humanity is the following: We have Paleolithic emotions, medieval institutions and godlike technology.</p><p>- Edward O. Wilson </p></blockquote><p>A lot of what Harari claims in the book can be disputed. For me the change of perspective is the truly valuable part, more than the various Anthropological and Socialogical assertions made.</p><p>Realizing the breadth of history our species covers is astonishing. Millions of years of evolution that accumulate to ridiculousness of our current age. The acceleration of the human race in terms of food, culture, technology, population is insane. The Scientific Revolution took place only 500 years ago! We learned how to cook with fire 300,000 years ago!</p><p>I think Harari does a good job at constructing a narrative around our species&#39; history, even if it requires a few jumps. I also enjoyed the last few chapters on capitalism and technology; they felt topical.</p><p>There’s too much to unpack from this book in this format. I’d highly recommend this book to anyone, it gives a great zoomed out perspective. My highlights are <a href=/highlights/sapiens>here</a>.</p><blockquote><p>The currency of evolution is neither hunger nor pain, but rather copies of DNA helixes. </p></blockquote><p></p>",
      "year": "2021"
    },
    {
      "title": "Let My People Go Surfing",
      "author": "Yvon Chouinard",
      "dateFinished": "07/03/2021",
      "descriptionHtml": "<p>Another memoir. This one by Yvon Chouinard, the founder of Patagonia. He writes about his journey to create one of world&#39;s most respected and environmentally conscious companies in the world. This book was reminiscent of Shoe Dog by Phil Knight. The main difference being Yvon&#39;s focus on the environment, something that seems to ground his entire life. He explores how environmental priorities fit into his company&#39;s growth and operation. There are strong anti-establishment sentiments throughout and it&#39;s hard to dispute them. Most systems and institutions that exist today are built without our planet in mind. Yvon makes this point abundantly clear. </p><p>Yet I am a relentless optimist, so I will strive to build more sustainable habits, buy a t-shirt from Patagonia and keep moving forward.</p><blockquote><p>The basic tenets of that philosophy are: a deep appreciation for the environment and a strong motivation to help solve the environmental crisis; a passionate love for the natural world; a healthy skepticism toward authority; a love for difficult, human-powered sports that require practice and mastery; a disdain for motorized sports like snowmobiling or jet skiing; a bias for whacko, often self-deprecating humor; a respect for real adventure (defined best as a journey from which you may not come back alive—and certainly not as the same person); a taste for real adventure; and a belief that less is more (in design and in consumption).</p></blockquote><blockquote><p>To expect corporations to do anything other than amass wealth is to ignore our culture’s entire history, current practices, current power structure and its system of rewards. It is to ignore everything we know about behavior modification: we reward those investing in or running corporations for what they do, and can therefore expect them to do it again. To expect those who hide behind corporate shields to do otherwise is delusional.</p></blockquote><p></p>",
      "year": "2021"
    },
    {
      "title": "Children of Dune",
      "author": "Frank Herbert",
      "dateFinished": "28/01/2021",
      "descriptionHtml": "<p>More fantasy. I&#39;m enjoying this saga more and more. This is usually the case when I read a book series. I&#39;m getting more familiar with the characters, more familiar with the environment, more familiar with <i>Dune</i>. This book follows the rule of Paul&#39;s sister, Alia. They dive more into psychological drama and superhuman powers(!). Onto the fourth.</p><p></p>",
      "year": "2021"
    },
    {
      "title": "The Dark Tower I: The Gunslinger",
      "author": "Stephen King",
      "dateFinished": "25/01/2021",
      "descriptionHtml": "<p>This story reads like a supernatural western and I like it. The protagonist, Roland, reminds me of Clint Eastwood in a cowboy movie. A loner; brooding, capable and stoic. And--like most of those types--he&#39;s on a quest with a singular purpose. This book feels old (in a good way) and so removed from what I&#39;ve been reading lately. It&#39;s nice to read fantasy and you can tell it&#39;s the beginning of an epic. I&#39;ll have to continue.</p><blockquote><p>Let the word and the legend go before you. There are those who \nwill carry both. Fools, perchance. Let the word go before you. Let your \nshadow grow. Let it grow hair on its face. Let it become dark. Given \ntime, words may even enchant an enchanter.</p></blockquote><p></p>",
      "year": "2021"
    },
    {
      "title": "A Promised Land",
      "author": "Barack Obama",
      "dateFinished": "10/01/2021",
      "descriptionHtml": "<p>Why am I so captivated by this book? I&#39;ll go through three reasons. </p><p>First: It shares the perspective of a U.S. president. Reading from the point of view of the most powerful (elected) person on the planet demands your attention by default.</p><p>Second: Most of the events portrayed in this book I’ve been aware of, if not impacted by: the 2008 financial crisis and the ensuing reforms, the resurgence of Al-Qaeda, the Deepwater Horizon oil spill, the Arab Spring and the ensuing Libyan Civil War, along with many others. Given that dreary list of geo-political incidents, it’s hard to imagine how this book could hold a hopeful tone. And yet it does.</p><p>Third: As well as being a talented speaker, Barack Obama is equally--if not more--talented at writing. His undeterred optimism permeates every chapter in this book without becoming cliché or overwhelming (at least to my taste). This goes beyond just a positive tone. In nearly every decision laid out in this book, Obama discusses a conflicting perspective. In some cases, that conflicting perspective is shared by a majority of the American public!</p><p>Of course, along with that unfettered optimism comes a substantial bias. We cannot gain a  complete understanding of Obama&#39;s presidency using <i>only</i> this as a source. But I hold this as an honest retelling.</p><p>I thoroughly enjoyed reading this memoir and I&#39;m looking forward to the next volume. My highlights are <a href=/highlights/a_promised_land>here</a>. </p><p>This quote refers to Manmohan Singh, the Prime Minister of India from 2004 to 2014.</p><blockquote><p>It wasn’t Singh’s fault. He had done his part, following the playbook of liberal democracies across the post–Cold War world: upholding the constitutional order; attending to the quotidian, often technical work of boosting the GDP; and expanding the social safety net. Like me, he had come to believe that this was all any of us could expect from democracy, especially in big, multiethnic, multireligious societies like India and the United States. Not revolutionary leaps or major cultural overhauls; not a fix for every social pathology or lasting answers for those in search of purpose and meaning in their lives. Just the observance of rules that allowed us to sort out or at least tolerate our differences, and government policies that raised living standards and improved education enough to temper humanity’s baser impulses.</p><p>Except now I found myself asking whether those impulses—of violence, greed, corruption, nationalism, racism, and religious intolerance, the all-too-human desire to beat back our own uncertainty and mortality and sense of insignificance by subordinating others—were too strong for any democracy to permanently contain. For they seemed to lie in wait everywhere, ready to resurface whenever growth rates stalled or demographics changed or a charismatic leader chose to ride the wave of people’s fears and resentments. And as much as I might have wished otherwise, there was no Mahatma Gandhi around to tell me what I might do to hold such impulses back.</p></blockquote><p></p>",
      "year": "2021"
    },
    {
      "title": "A Visit from the Goon Squad",
      "author": "Jennifer Egan",
      "dateFinished": "02/01/2021",
      "descriptionHtml": "<p>I love this book. Describes the intertwining lives of Bennie and Sasha. The story feels melancholy the whole way through, but there are enough happy moments to pull you through. I&#39;ve read this book three times now.</p>",
      "year": "2021"
    },
    {
      "title": "Homeland Elegies: A Novel",
      "author": "Ayad Akhtar",
      "dateFinished": "23/12/2020",
      "descriptionHtml": "<p>Ayad Akhtar is a second generation Muslim immigrant and playwright. I thought this book was a memoir at first. It ends up being a set of  stories involving the author, some fictional, some not. Speaks a lot to the American ideology and how Muslims fit into it. Also mentions the merits of Freud, the Roman concept of a corporation, a Muslim&#39;s perception of a Christian America and other interesting topics. I would love to read a book in this style from an author who grew up in Canada instead of America.</p>",
      "year": "2020"
    },
    {
      "title": "Dune Messiah",
      "author": "Frank Herbert",
      "dateFinished": "15/11/2020",
      "descriptionHtml": "<p>Second book in the Dune series. This one takes place 12 years after the first. I found Dune Messiah to be more introspective than Dune, which is saying something. Paul rules as Emperor while various parties attempt to unseat him. His legacy plays a big role in this book. The ending is intense and surprised me.</p>",
      "year": "2020"
    },
    {
      "title": "A Memory Called Empire",
      "author": "Arkady Martine",
      "dateFinished": "27/10/2020",
      "descriptionHtml": "<p>Engaging science fiction. This book was nominated for the Nebula Award which is how I first discovered it. A space opera I think? Focuses on literature, poetry and the functionings of an interplanetary empire. This book was similar to Dune in that sense. Also similar pacing; slow at the beginning, faster towards the end. I will devour the sequel when it arrives.</p>",
      "year": "2020"
    },
    {
      "title": "Dune",
      "author": "Frank Herbert",
      "dateFinished": "19/09/2020",
      "descriptionHtml": "<p>My first science-fiction in a while. The deeper I got into this book, the more I appreciated its eloquence. Frank Herbert plays with the order of words in sentences, &quot;There is probably no more terrible instant of enlightenment than the one in which you discover your father is a man - with human flesh.&quot; Instead of technology, it focuses more on humanity and politics and relationships. The book speaks to so many things beyond its fantastic setting. The nature of fear, leadership, religion, prophecy, belief, politics, technology, future.  The protagonist, Paul, undergoes a fantastic character arc that is interesting at every point. Frank Herbert does a great job of switching between the thoughts and perspectives of each character. It&#39;s like we&#39;re an X-ray camera that&#39;s just swooping through characters&#39; thoughts. Although it starts out slow, the book is always accelerating so that by the end it is impossible to stop reading. I&#39;m currently reading through the <a href=\"https://en.wikipedia.org/wiki/Dune_(novel)\" target=\"_blank\">wikipedia page</a>. I really enjoyed this book and will be reading the sequel.</p>",
      "year": "2020"
    },
    {
      "title": "The Topeka School",
      "author": "Ben Lerner",
      "dateFinished": "24/08/2020",
      "descriptionHtml": "<p>This is another one I&#39;ve been reading intermittently. Definitely a more intricate writing style than I&#39;ve encountered before. The author, Ben Lerner, dips into several different characters, their motivations, their struggles. Sometimes in first person, sometimes in third person. The timeline shifts, there are many flashback episodes and jumps to the future. But ultimately it&#39;s a story about a family. Beyond that I&#39;m not sure. I think I was more enamored with the vivid reality Lerner constructs than the characters in it. The most interesting part for me was his depictions of oratory debate. I should&#39;ve done that in high school.</p>",
      "year": "2020"
    },
    {
      "title": "A Place of My Own",
      "author": "Michael Pollan",
      "dateFinished": "06/08/2020",
      "descriptionHtml": "<p>I&#39;ve been reading this one for a while. This is Michael Pollan&#39;s first book. He explores topics like architecture and carpentry through the design and construction of a writing cabin in his backyard. In fact, he is closely involved at every step. I was going to start a degree in architecture once upon a time so this book was both interesting and enlightening for me. Building a house is fascinating. I especially enjoyed his description of various types of wood and his criticisms of modernist pane-glass architecture.</p>",
      "year": "2020"
    },
    {
      "title": "The 7½ Deaths of Evelyn Hardcastle",
      "author": "Stuart Turton",
      "dateFinished": "02/08/2020",
      "descriptionHtml": "<p>A murder mystery. This book keeps piling on layers of complexity in each chapter, which make it sometimes difficult to understand. That said, it wraps up nicely. The setting reminds me of that board game Clue. I would like to read more fiction.</p>",
      "year": "2020"
    },
    {
      "title": "The Omnivores Dilemma",
      "author": "Michael Pollan",
      "dateFinished": "03/07/2020",
      "descriptionHtml": "<p>I&#39;ve sort of fallen in love with Michael Pollan&#39;s mentality when it comes to food. There are countless reasons to read this book. There is so much to learn about the food industry and the implications of what we eat. I am convinced this stuff is worth learning. How does the food you eat get to your table? Which animals had to die? Which plants had to be grown? Where? This book is sometimes dense, but even reading the first section about corn is mind-boggling.  It&#39;s only five chapters. Beyond the industrial food system, this book offers a stark illustration of the weaknesses (or failures) of capitalism. Pollan often talks about how the capitalist system doesn&#39;t exactly work with two natural systems at both ends of the industrial food chain (the farmer&#39;s field and the human body). This book has motivated me to buy sustainable meat and eat much less of it. And to try and buy local as much as I can. So much more is discussed in this book, I&#39;ve tried to elaborate with the highlights <a href=/highlights/the_omnivores_dilemma>here</a>. </p><blockquote><p>Industrial processes follow a clear, linear, hierarchical logic that is fairly easy to put into words, probably because words follow a similar logic: First this, then that; put this in here, and then out comes that. But the relationship between cows and chickens on this farm (leaving aside for the moment the other creatures and relationships present here) takes the form of a loop rather than a line, and that makes it hard to know where to start, or how to distinguish between causes and effects, subjects and objects. Is what I&#39;m looking at in this pasture a system for producing exceptionally tasty eggs? If so, then the cattle and their manure are a means to an end. Or is it a system for producing grass-fed beef without the use of any chemicals, in which case the chickens, by fertilizing and sanitizing the cow pastures, comprise the means to that end? So does that make their eggs a product or a by-product? And is manure—theirs or the cattle&#39;s—a waste product or a raw material? (And what should we call the fly larvae?) Depending on the point of view you take—that of the chicken, the cow, or even the grass—the relationship between subject and object, cause and effect, flips. </p></blockquote><blockquote><p>A tension has always existed between the capitalist imperative to maximize efficiency at any cost and the moral imperatives of culture, which historically have served as a counterweight to the moral blindness of the market. This is another example of the cultural contradictions of capitalism—the tendency over time for the economic impulse to erode the moral underpinnings of society. Mercy toward the animals in our care is one such casualty. </p></blockquote><blockquote><p>What&#39;s wrong with eating animals is the practice, not the principle. What this suggests to me is that people who care about animals should be working to ensure that the ones they eat don&#39;t suffer, and that their deaths are swift and painless—for animal welfare, in others words, rather than rights. </p></blockquote><p></p>",
      "year": "2020"
    },
    {
      "title": "Between the World and Me",
      "author": "Ta-Nehisi Coates",
      "dateFinished": "11/06/2020",
      "descriptionHtml": "<p>I thought this book was poetic.  It speaks in thoughts and ideas and helps convey history of black people in America. It&#39;s sad too. Though not on purpose. It&#39;s written in second person, as Ta-Nehisi Coates writing to his son. Coates goes over his own experience and illuminates hard truths for his son. There are no easy answers. This isn&#39;t a hopeful book. But it is honest. It&#39;s a necessary reflection and broadened my perspective for sure. Highlights <a href=/highlights/between_the_world_and_me>here</a>. </p><blockquote><p>But race is the child of racism, not the father. And the process of naming “the people” has never been a matter of genealogy and physiognomy so much as one of hierarchy. Difference in hue and hair is old. But the belief in the preeminence of hue and hair, the notion that these factors can correctly organize a society and that they signify deeper attributes, which are indelible—this is the new idea at the heart of these new people who have been brought up hopelessly, tragically, deceitfully, to believe that they are white. </p><p>- Ta-Nehisi Coates, Between the World and Me</p></blockquote><p></p>",
      "year": "2020"
    },
    {
      "title": "The Testaments",
      "author": "Margaret Atwood",
      "dateFinished": "05/05/2020",
      "descriptionHtml": "<p>I did not realize this book was a sequel. It takes place 15 years after the events of The Handmaid&#39;s Tale which I have not read. Despite this, I got the gist of the setting pretty quickly. Most of the book takes place in the Gilead, a totalitarian patriarchal theocratic state that &quot;rules over most of the territory that belonged to the former continental United States&quot;. We follow three characters, Agnes, Nicole and Aunt Lydia. The narrative is interesting because we&#39;re reading the testimony of Agnes and Nicole and the handwritten notes of Aunt Lydia. The Gilead is such a strange and terrible society yet it&#39;s easy to see how it <i>could</i> work. If you want to read about the fall of an awful, cruel, sexist dystopian state then you&#39;ll probably enjoy this one.</p>",
      "year": "2020"
    },
    {
      "title": "Little Fires Everywhere",
      "author": "Celeste Ng",
      "dateFinished": "16/04/2020",
      "descriptionHtml": "<p>This was a quick read for me. It&#39;s one of those stories that sucks you in the further you get. Focuses on two families, the Richardson&#39;s and the Warrens. The former is wealthy, settled down, stable. The latter is lower-class, nomadic, unstructured. It explores the lives of almost everyone who make up these two families and how they interact with each other. Interestingly, I can&#39;t think of an obvious antagonist. The author, Celeste Ng, often gives the perspective of every character involved and goes through their reasoning. It&#39;s hard to judge someone as an antagonist if their reasoning follows your own. </p><blockquote><p>Parents, she thought, learned to survive touching their children less and less. As a baby Pearl had clung to her; she’d worn Pearl in a sling because whenever she’d set her down, Pearl would cry. There’d scarcely been a moment in the day when they had not been pressed together. As she got older, Pearl would still cling to her mother’s leg, then her waist, then her hand, as if there was something in her mother she needed to absorb through the skin. Even when she had her own bed, she would often crawl into Mia’s in the middle of the night and burrow under the old patchwork quilt, and in the morning they would wake up tangled, Mia’s arm pinned beneath Pearl’s head, or Pearl’s legs thrown across Mia’s belly. Now, as a teenager, Pearl’s caresses had become rare—a peck on the cheek, a one-armed, half-hearted hug—and all the more precious because of that. It was the way of things, Mia thought to herself, but how hard it was. The occasional embrace, a head leaned for just a moment on your shoulder, when what you really wanted more than anything was to press them to you and hold them so tight you fused together and could never be taken apart. It was like training yourself to live on the smell of an apple alone, when what you really wanted was to devour it, to sink your teeth into it and consume it, seeds, core, and all. </p><p>- Celeste Ng, Little Fires Everywhere</p></blockquote><p></p>",
      "year": "2020"
    },
    {
      "title": "Talking to Strangers",
      "author": "Malcolm Gladwell",
      "dateFinished": "12/03/2020",
      "descriptionHtml": "<p>I&#39;ve been working my way through this one for a while. It&#39;s an interesting examination of several notable events including Sandra Bland&#39;s suicide, the Brock Turner incident and Neville Chamberlain&#39;s meeting with Hitler. It&#39;s fun to follow Gladwell try to find an underlying logic to all these extraordinary events. As I understand it, he&#39;s saying that humans are bad at understanding and communicating with strangers. Often our <i>human nature</i> moves us in the wrong directions. Most of the time, I am convinced by his conclusions. Like all his other books, it&#39;s an interesting read.</p>",
      "year": "2020"
    },
    {
      "title": "When Breath Becomes Air",
      "author": "Paul Kalanithi",
      "dateFinished": "11/02/2020",
      "descriptionHtml": "<p>This is the first book in recent memory to make me cry. It&#39;s an autobiography and memoir written by Paul Kalanithi, a neurosurgeon. Paul was diagnosed with terminal cancer pretty early in his life. This book is his reflection on mortality, among other things. It&#39;s poetic, witty, smart and sometimes a bit arrogant. Examines what really matters when you&#39;re staring death in the face. It&#39;s not a long book and I read it quickly. Highly recommend this one. I&#39;m grateful to have read it.</p>",
      "year": "2020"
    },
    {
      "title": "The Body: A Guide for Occupants",
      "author": "Bill Bryson",
      "dateFinished": "06/02/2020",
      "descriptionHtml": "<p>Another long non-fiction book. It has always been confusing to me why I have barely any idea how my own body works. This book gave me a helpful overview of what&#39;s going on. It also helped me understand how little we actually know. Either way, our bodies are incredible. So many quotes that can shift your perspective if you&#39;re up for it. Highlights <a href=/highlights/the_body>here</a>. </p><blockquote><p>That is unquestionably the most astounding thing about us—that we are just a collection of inert components, the same stuff you would find in a pile of dirt. I’ve said it before in another book, but I believe it’s worth repeating: the only thing special about the elements that make you is that they make you. That is the miracle of life.</p><p> - Bill Bryson, The Body: A Guide for Occupants</p></blockquote><p></p>",
      "year": "2020"
    },
    {
      "title": "21 Lessons for the 21st Century",
      "author": "Yuval Noah Harari",
      "dateFinished": "18/12/2019",
      "descriptionHtml": "<p>I&#39;ve been slowly reading this one for a while. It&#39;s a book whose concepts encourage critical thought. In virtually every chapter. I really enjoy the way Yuval Noah Harari approaches and considers problems. And despite the large concepts, it&#39;s gratifying to come to some sort of greater understanding at the end of each chapter. A great book to talk about with friends. Especially if they&#39;re studying political science. So many interesting ideas on how to attack policy changes, human behaviour, big stuff. I hope you&#39;ll browse the <a href=/highlights/21_lessons>highlights</a>.</p>",
      "year": "2019"
    },
    {
      "title": "Fleishman Is in Trouble",
      "author": "Taffy Brodesser-Akner",
      "dateFinished": "25/11/2019",
      "descriptionHtml": "<p>A story about a couple. Their divorce, their children, the origins of their conflict. Told from the perspective of the husband’s close friend. The narrative explores both sides of the conflict. The husband, Toby, is more responsible for the kids while the wife, Rachel, is determined to work more. Made me think about the idea that there’s not always a culprit for bad shit that happens. Sometimes you can’t blame anyone. Despite that bleak realization, it is still a funny book and I enjoyed it.</p>",
      "year": "2019"
    },
    {
      "title": "Alex's Adventures in Numberland",
      "author": "Alex Bellos",
      "dateFinished": "04/10/2019",
      "descriptionHtml": "<p>One of the most interesting non-fiction books I&#39;ve read in a while. I will say it&#39;s put me sleep more than once, but only while I&#39;m reading before bed. A book that certainly made me more interested in numbers. The symmetry and poetry of math is astonishing. It&#39;s funny how a book about numbers has made me more interested in math than ~7 years of math classes. Really cool stuff. Highlights <a href=/highlights/numberland>here</a>.</p>",
      "year": "2019"
    },
    {
      "title": "The Wind-Up Bird Chronicle",
      "author": "Haruki Murakami",
      "dateFinished": "30/08/2019",
      "descriptionHtml": "<p>The first Japanese author I&#39;ve read. Really interesting style. Focuses on relationships and sex and lust. And a well. It&#39;s all very mysterious but well put together.</p>",
      "year": "2019"
    },
    {
      "title": "Children of Time",
      "author": "Adrian Tchaikovsky",
      "dateFinished": "07/07/2019",
      "descriptionHtml": "<p>Coming back to science fiction after a while. This book is about what happens to humanity thousands of years in the future. It follows the development of a society. Gets interesting early on, and the characters evolve wildly by the end. A bit unsettling at times, but a happy ending.</p>",
      "year": "2019"
    },
    {
      "title": "The Overstory",
      "author": "Richard Powers",
      "dateFinished": "06/05/2019",
      "descriptionHtml": "<p>This book begins as separate stories that revolve around several motifs; trees, nature, resistance, activism. I love how the book starts, the characters are immediately so interesting to me. It’s an emotional book. I need to read it again. A lot about inner dialogue, relationships and the names of trees. </p>",
      "year": "2019"
    },
    {
      "title": "Interpreter of Maladies",
      "author": "Jhumpa Lahiri",
      "dateFinished": "16/04/2019",
      "descriptionHtml": "<p>A collection of short stories centered around recent immigrants from India to the US. I can empathize with this one more than usual. My mother’s side followed this immigrant experience pretty closely. It’s good at describing the sacrifices made and motivations, etc. <a href=\"https://www.washingtonpost.com/news/arts-and-entertainment/wp/2015/11/12/aziz-ansaris-new-show-perfectly-captures-what-its-like-being-the-child-of-immigrants/?utm_term=.642150921c67\" target=\"_blank\">S1E2</a> of Master of None is in the same vein. Well written and personally relevant.</p>",
      "year": "2019"
    },
    {
      "title": "Less",
      "author": "Andrew Sean Greer",
      "dateFinished": "24/03/2019",
      "descriptionHtml": "<p>This was the first explicitly comedic book I&#39;ve read in a while. I thought it was sharper than it was funny, but often those two go hand in hand. Witty and quick but emotional. I can honestly say I have a different perspective on relationships after reading it. Maybe I&#39;ll read it again when I turn 45. Highlights <a href=/highlights/less_a_novel>here</a>.</p>",
      "year": "2019"
    },
    {
      "title": "Ghost Town",
      "author": "??",
      "dateFinished": "21/02/2019",
      "descriptionHtml": "<p>I haven’t read science-fiction in a while so this was refreshing. The tone of this book is similar to the first season of True Detective; nihilistic, brutal crimes, Midwestern America. The cool part was the time travel. It was well thought out and actually added to the story instead of distracting from it. Overall it’s gritty but smart and the ending is fantastic.</p>",
      "year": "2019"
    },
    {
      "title": "Animal Farm",
      "author": "George Orwell",
      "dateFinished": "19/02/2019",
      "descriptionHtml": "<p>A classic Orwell story that I should’ve read earlier. Apparently he meant to expose the “Soviet myth” with this one. It’s not long, only took a day to read. Illustrates a bunch of political realities really well. Made me more aware of the fragility we are living through. Highlights <a href=/highlights/animal_farm>here</a>.</p>",
      "year": "2019"
    },
    {
      "title": "Educated",
      "author": "Tara Westover",
      "dateFinished": "13/02/2019",
      "descriptionHtml": "<p>This story is astonishing. The realities the author lived through and managed to escape are unlike anything I’ve ever seen or read about. She was raised in a separate reality dictated by her father. Beyond that, the patterns of abuse within the family made parts of this book difficult to read. Yet Tara managed to escape and get an education. The book made me realize how terrifying it is that education is becoming a political device. A broader perspective should be everyone’s right.</p>",
      "year": "2019"
    },
    {
      "title": "Asymmetry",
      "author": "Lisa Halliday",
      "dateFinished": "05/02/2019",
      "descriptionHtml": "<p>The structure of this book is a bit of a puzzle. The first, second and third all act tie together in a subtle way. I like the book because of the content, not the puzzle. Intricate and enjoyed.</p>",
      "year": "2019"
    },
    {
      "title": "Still Me",
      "author": "Jojo Moyes",
      "dateFinished": "23/01/2019",
      "descriptionHtml": "<p>I didn&#39;t realize this book was part of a trilogy until I finished it which I guess is a good thing. It’s a story that focuses around life and growing up and relationships and New York City. I really enjoyed it. A great ending too.</p>",
      "year": "2019"
    },
    {
      "title": "Priestdaddy",
      "author": "Patricia Lockwood",
      "dateFinished": "20/01/2019",
      "descriptionHtml": "<p>I read this one last year but never wrote about it. This book is hilarious. Focuses on the struggles of masculinity, church, religion, family. Manages to find humour in every one of those topics. I really liked it. Highlights <a href=/highlights/priestdaddy>here</a>.</p>",
      "year": "2019"
    },
    {
      "title": "Shoe Dog",
      "author": "Phil Knight",
      "dateFinished": "07/01/2019",
      "descriptionHtml": "<p>This book motivates yet discourages entrepreneurship for me. The thrill of working towards a vision you create, changing customers’ lives, the idea of having a legacy, are all overwhelmingly desirable. And since Phil seems like the most humble of founding billionaires, the ups and downs of his story are described pretty objectively. But his storytelling leads to many reflections on what he is sacrificing to achieve those goals. And I empathized with those parts more. Knight’s journey makes for a thrilling story either way.</p>",
      "year": "2019"
    },
    {
      "title": "Leviathan Wakes",
      "author": "James S. A. Corey",
      "dateFinished": "31/12/2018",
      "descriptionHtml": "<p>I haven’t read any new science-fiction in a while. This book grabbed me. It’s gritty, intricate, emotional and never dull. Will probably keep reading this series. Not sure why I haven’t been reading more science-fiction.</p>",
      "year": "2018"
    },
    {
      "title": "Bad Blood",
      "author": "John Carreyrou",
      "dateFinished": "30/12/2018",
      "descriptionHtml": "<p>Read this one quickly. This is the story behind the rise and fall of Theranos. If that company is unknown to you, I highly recommend looking them up. The story is larger than life and illustrates the strange motivations that govern Silicon Valley. It’s disturbing how much they got away with and for how long. It made me question the whole ecosystem. They’ll probably make a movie about it soon. </p><blockquote><p>…in her all-consuming quest to be the second coming of Steve Jobs amid the gold rush of the “unicorn” boom, there came a point when she stopped listening to sound advice and began to cut corners. Her ambition was voracious and it brooked no interference.</p></blockquote><p></p>",
      "year": "2018"
    },
    {
      "title": "Circe",
      "author": "Madeline Miller",
      "dateFinished": "29/12/2018",
      "descriptionHtml": "<p>I love the Greek Gods. Their combination of vanity and absolute power always makes for exciting stories. This book went by quickly. It’s a retelling of <i>The Odyssey</i> and several other classic Greek tales from the perspective of the Goddess Circe. Reading it felt somewhat similar to Percy Jackson but I wouldn’t recommend it to children. It explores the idea of immortality, love, children, beauty. There is a happy ending. </p><blockquote><p>he had never met a god who enjoyed their divinity less.</p></blockquote><p></p>",
      "year": "2018"
    },
    {
      "title": "Naked Economics",
      "author": "Charles Wheelan",
      "dateFinished": "28/12/2018",
      "descriptionHtml": "<p>I haven&#39;t finished this book yet. Mostly because it has a tendency to put me to sleep which is convenient since I read it right before bed. Despite that, I enjoy every second I&#39;m awake! Hopefully it will be done by Christmas. Highlights <a href=/highlights/naked_economics>here</a>. (Update: Finished it) </p>",
      "year": "2018"
    },
    {
      "title": "Orchid and the Wasp",
      "author": "Caoilinn Hughes",
      "dateFinished": "27/12/2018",
      "descriptionHtml": "<p>This book reminds me of The Goldfinch. Despite the unusual situations Gael (the protagonist) finds herself in, I <i>believe</i> in the logic of why she got there. In fact, I feel like that&#39;s where I would be in her shoes despite her facetious, ruthless, manipulative personality. Yet at her core, Gael is motivated by her caring for her family. I guess the ends justify the means. Highlights <a href=/highlights/orchid_and_the_wasp>here</a>.</p>",
      "year": "2018"
    },
    {
      "title": "The Looming Tower",
      "author": "Lawrence Wright",
      "dateFinished": "26/12/2018",
      "descriptionHtml": "<p>This is the first non-fiction book that has kept me engaged for over a month of regular reading. The book explores Islam, US Policy, personal motivations; and culminates in 9/11. Despite this inevitable conclusion, what kept me reading is the background leading up to the event and not the event itself. My knowledge surrounding the events leading up to 9/11 involving Bin Laden, Sudan, Yemen and Saudi Arabia was murky and misinformed until I started reading this book.</p>",
      "year": "2018"
    }
  ]
}